{
  "setting": "Cài đặt",
  "account": {
    "title": "Tài khoản",
    "email": "Email",
    "phone": "Số điện thoại",
    "google": "Google"
  },
  "language": {
    "title": "Ngôn ngữ",
    "vietnamese": "Tiếng Việt",
    "english": "English"
  },
  "darkMode": "Chế độ tối",
  "notification": {
    "title": "Thông báo",
    "comment": "Bình luận",
    "vote": "Bình chọn",
    "follow": "Theo dõi"
  },
  "termOfServices": {
    "title": "Điều khoản dịch vụ",
    "content": "Có hiệu lực từ ngày 01 tháng 11 năm 2018\n\nVUI LÒNG ĐỌC KỸ CÁC ĐIỀU KHOẢN VÀ ĐIỀU KIỆN NÀY TRƯỚC KHI SỬ DỤNG TRANG WEB HOẶC ỨNG DỤNG NÀY\n\n\n\nCác điều khoản dịch vụ này (“Điều khoản dịch vụ”) (cùng với các tài liệu mà chúng tham chiếu đến) cho bạn biết các điều khoản mà bạn có thể sử dụng trang web của Tastopia (“Trang web”) hoặc ứng dụng di động (“Ứng dụng”). Việc sử dụng Trang web hoặc Ứng dụng bao gồm truy cập, duyệt hoặc đăng ký để sử dụng Trang web hoặc Ứng dụng.\n\n\n\nTrang web và Ứng dụng này được điều hành bởi chi nhánh đã đăng ký tại Vương quốc Anh của Tastopia Inc., một công ty được đăng ký tại 4-20-3 Ebisu, Shibuya-ku, Tokyo, Nhật Bản (\"chúng tôi\", \"của chúng tôi\" hoặc \"Tastopia\") và các công ty liên kết (là các thực thể kiểm soát, được kiểm soát bởi hoặc dưới sự kiểm soát chung với Tastopia).\n\n\n\nBằng cách sử dụng Trang web hoặc Ứng dụng của chúng tôi, bạn xác nhận rằng bạn chấp nhận và đồng ý tuân thủ các Điều khoản dịch vụ được nêu dưới đây. Nếu bạn không đồng ý với các Điều khoản dịch vụ này, bạn không được sử dụng Trang web hoặc Ứng dụng của chúng tôi. Chúng tôi khuyên bạn nên giữ một bản sao của các Điều khoản dịch vụ này để tham khảo trong tương lai.\n\n\n\n1. CHÍNH SÁCH BỔ SUNG\n\nCác chính sách bổ sung sau đây cũng áp dụng khi bạn sử dụng Trang web hoặc Ứng dụng của chúng tôi:\n\n\n\nChính sách bảo mật của chúng tôi, giải thích thông tin cá nhân nào chúng tôi thu thập, lý do chúng tôi thu thập, cách chúng tôi sử dụng thông tin, các biện pháp kiểm soát bạn có đối với thông tin cá nhân của mình và các quy trình chúng tôi áp dụng để bảo vệ quyền riêng tư của bạn. Chính sách này áp dụng cho thông tin cá nhân chúng tôi thu thập thông qua Trang web và Ứng dụng. Vui lòng đảm bảo rằng bạn đọc kỹ Chính sách bảo mật của chúng tôi trước khi sử dụng Trang web hoặc Ứng dụng.\n\nNguyên tắc cộng đồng của chúng tôi, nêu rõ các cách sử dụng được phép và bị cấm đối với Trang web hoặc Ứng dụng của chúng tôi. Các Nguyên tắc cộng đồng này là một phần của Điều khoản dịch vụ này, do đó, các tham chiếu đến Điều khoản dịch vụ bao gồm chúng.\n\n2. THÔNG TIN VỀ CHÚNG TÔI\n\nChúng tôi là chi nhánh đã đăng ký tại Vương quốc Anh của Tastopia Inc., một công ty được đăng ký tại 4-20-3 Ebisu, Shibuya-ku, Tokyo, Nhật Bản. Chi nhánh có văn phòng tại Silversmiths 1 – 3 Broad Plain, Bristol, BS2 0JP, Vương quốc Anh.\n\n\n\nNếu bạn có bất kỳ câu hỏi hoặc khiếu nại nào về Trang web hoặc Ứng dụng của chúng tôi hoặc về bất kỳ khía cạnh nào về Tastopia, vui lòng liên hệ với chúng tôi theo địa chỉ: info-vn@tastopia.com\n\n\n\n3. THÔNG TIN VỀ TRANG WEB VÀ ỨNG DỤNG CỦA CHÚNG TÔI\n\nTrang web và Ứng dụng của chúng tôi cung cấp cho bạn khả năng chia sẻ công thức nấu ăn với những người dùng khác trên Trang web và Ứng dụng của chúng tôi và duyệt công thức nấu ăn của những người dùng khác (Dịch vụ Tastopia). Ngoại trừ các Dịch vụ Cao cấp tùy chọn mà chúng tôi có thể cung cấp (xem Mục 7), Dịch vụ Tastopia được cung cấp miễn phí.\n\n\n\nTrang web của chúng tôi được thiết kế để hoạt động trên các trình duyệt web hiện đại, các hệ điều hành và nền tảng chính. Các tính năng và khả năng tương thích có thể khác nhau giữa một số trình duyệt web, hệ điều hành và nền tảng\n\n\n\nChúng tôi có thể sử dụng nhà cung cấp dịch vụ bên thứ ba để cung cấp Dịch vụ Tastopia hoặc để thực hiện nghĩa vụ của chúng tôi theo các Điều khoản dịch vụ này.\n\n\n\nChúng tôi không đảm bảo rằng Trang web hoặc Ứng dụng của chúng tôi, bất kỳ nội dung nào trên đó hoặc các dịch vụ do các nhà cung cấp dịch vụ bên thứ ba cung cấp sẽ không có lỗi hoặc thiếu sót.\n\n\n\n4. THÔNG TIN QUAN TRỌNG VỀ CÔNG THỨC\n\nTất cả các công thức nấu ăn trên Trang web hoặc Ứng dụng của chúng tôi chỉ được cung cấp cho mục đích thông tin chung và được những người dùng khác, như bạn, đăng tải chứ không phải Tastopia. Tastopia không sàng lọc hoặc kiểm tra các công thức nấu ăn trước khi đăng tải, do đó có thể có một số công thức, nguyên liệu hoặc phương pháp nấu ăn không phù hợp, không chính xác hoặc không an toàn. Các công thức nấu ăn, bình luận và thông tin khác được cung cấp trên Trang web hoặc Ứng dụng của chúng tôi không nhằm mục đích đưa ra lời khuyên mà bạn nên dựa vào, và bất kỳ việc sử dụng hoặc dựa vào bất kỳ công thức nấu ăn nào hoặc nội dung khác được cung cấp trên Trang web hoặc Ứng dụng của chúng tôi đều do bạn tự chịu rủi ro.\n\n\n\nTastopia không đưa ra bất kỳ tuyên bố nào, dù là rõ ràng hay ngụ ý, về tính chính xác, chất lượng, sự an toàn hoặc tính phù hợp của các công thức nấu ăn được công bố trên Dịch vụ Tastopia.\n\n\n\nVì thế:\n\n\n\nbạn nên xác minh bất kỳ thành phần hoặc phương pháp bất thường hoặc mới lạ nào trong công thức bằng cách tham khảo các nguồn khác;\n\nbạn phải tuân thủ mọi thông báo hoặc bản tin về an toàn thực phẩm do chính quyền địa phương của bạn ban hành và bạn không nên mong đợi Dịch vụ Tastopia ghi nhận hoặc giải thích các rủi ro có trong quá trình chế biến thực phẩm, phương pháp hoặc kỹ thuật nấu nướng hoặc tiêu thụ một số loại thực phẩm nhất định; và\n\nnếu bạn không phải là một đầu bếp có kinh nghiệm, chúng tôi khuyên bạn nên xin hướng dẫn từ một đầu bếp có kinh nghiệm hoặc một cơ quan có thẩm quyền khác khi sử dụng các công thức nấu ăn từ Dịch vụ Tastopia, đặc biệt là về vấn đề sức khỏe và an toàn.\n\nNếu bạn có bất kỳ bình luận hoặc lo ngại nào về bất kỳ công thức nấu ăn hoặc nội dung nào khác trên Dịch vụ Tastopia hoặc nếu bạn tin rằng tác phẩm có bản quyền của mình đã bị vi phạm hoặc biết về tài liệu vi phạm, bất hợp pháp hoặc không phù hợp khác, vui lòng liên hệ với chúng tôi theo địa chỉ: info-vn@tastopia.com\n\n\n\n5. ĐĂNG KÝ NGƯỜI DÙNG\n\nLiên quan đến Trang web của chúng tôi, bạn có thể truy cập và xem các công thức nấu ăn mà không cần đăng ký với tư cách là khách (“Khách”). Tuy nhiên, bạn sẽ có quyền truy cập vào nhiều tính năng hơn của Dịch vụ Tastopia nếu bạn tạo tài khoản thông qua đăng ký. Nếu bạn muốn đăng ký tài khoản để sử dụng Dịch vụ Tastopia, bạn sẽ phải hoàn thành thông tin tài khoản bắt buộc theo yêu cầu của chúng tôi thông qua việc gửi đơn đăng ký theo định dạng mà chúng tôi có thể chỉ định hoặc đăng ký bằng tài khoản của bên thứ ba (ví dụ: Facebook, Google).\n\n\n\nChúng tôi sẽ tiến hành các bước kiểm tra cần thiết về quá trình đăng ký của bạn trước hoặc sau quá trình đăng ký và sau khi chúng tôi chấp nhận, bạn sẽ được đăng ký là người dùng đã đăng ký (“Người dùng đã đăng ký”).\n\n\n\nChúng tôi có quyền đình chỉ, thu hồi hoặc ngừng tài khoản, thông tin tài khoản hoặc mật khẩu của bạn trong các trường hợp sau. Khi có thể, chúng tôi sẽ thông báo cho bạn về ý định thực hiện việc này và cho bạn cơ hội kháng cáo:\n\n\n\nbạn không tồn tại;\n\nbạn không có địa chỉ email có thể nhận email;\n\nbạn vi phạm các Điều khoản dịch vụ này;\n\nbạn đã hoặc có vẻ như đã cố ý cung cấp thông tin sai lệch cho chúng tôi;\n\nbạn là trẻ vị thành niên và chưa gửi thông tin tài khoản với sự chấp thuận của cha mẹ hoặc người giám hộ;\n\nđể ứng phó với các mối đe dọa thực tế hoặc tiềm ẩn đối với doanh nghiệp của chúng tôi (chẳng hạn như các mối đe dọa về an ninh mạng) hoặc các hành vi hoặc hoạt động không mong muốn hoặc nguy hiểm trong cộng đồng của chúng tôi; hoặc\n\nvì bất kỳ lý do nào được nêu trong Mục 18 dưới đây.\n\n6. TÀI KHOẢN VÀ MẬT KHẨU CỦA BẠN\n\nNếu bạn chọn trở thành Người dùng đã đăng ký, bạn phải coi thông tin tài khoản của mình là bí mật. Bạn không được tiết lộ thông tin này cho bất kỳ bên thứ ba nào. Bạn chấp nhận toàn bộ trách nhiệm và nghĩa vụ đối với mọi hoạt động diễn ra trong tài khoản của bạn, trừ khi đó là lỗi của chúng tôi.\n\n\n\nNếu bạn biết hoặc nghi ngờ rằng bất kỳ ai khác ngoài bạn biết tài khoản của bạn, bạn phải thông báo ngay cho chúng tôi theo địa chỉ info-vn@tastopia.com\n\n\n\n7. DỊCH VỤ CAO CẤP\n\nTính khả dụng. Chúng tôi có thể cung cấp dịch vụ tùy chọn tính phí đăng ký (“Dịch vụ cao cấp”) hướng đến một số quốc gia nhất định. Nếu Dịch vụ cao cấp khả dụng ở khu vực của bạn, dịch vụ này có thể khả dụng trên Trang web của chúng tôi (“Dịch vụ web cao cấp”) và/hoặc Ứng dụng (“Dịch vụ ứng dụng cao cấp”) hoặc cả hai.\n\n\n\nSử dụng. Bất kể bạn có đăng ký Dịch vụ cao cấp thông qua Trang web hay Ứng dụng của chúng tôi hay không, bạn vẫn có thể sử dụng Dịch vụ cao cấp và các tính năng của dịch vụ này trên cả Dịch vụ web cao cấp và Dịch vụ ứng dụng cao cấp khi có tại quốc gia hoặc khu vực của bạn. Tuy nhiên, các tính năng và chức năng có sẵn có thể khác nhau tùy thuộc vào việc bạn đang sử dụng Dịch vụ web cao cấp hay Dịch vụ ứng dụng cao cấp.\n\n\n\n8. PHÍ DỊCH VỤ CAO CẤP\n\nPhí đăng ký. Nếu Dịch vụ cao cấp khả dụng với bạn, phí cho Dịch vụ cao cấp sẽ được nêu trên Trang web hoặc trong Ứng dụng của chúng tôi (“Phí đăng ký”). Phí đăng ký có thể thay đổi tùy theo quốc gia mà Dịch vụ cao cấp hướng đến và tùy thuộc vào việc bạn đăng ký Dịch vụ cao cấp thông qua Trang web hay Ứng dụng của chúng tôi. Nếu đăng ký thông qua Ứng dụng của chúng tôi, Phí đăng ký cũng có thể thay đổi tùy thuộc vào việc bạn sử dụng nền tảng iOS hay Android. Phí đăng ký cho Dịch vụ cao cấp được thanh toán như sau:\n\n\n\nDịch vụ cao cấp được đăng ký qua trang web của chúng tôi: Phí đăng ký. Nếu bạn đăng ký Dịch vụ cao cấp qua trang web của chúng tôi, Phí đăng ký sẽ được thanh toán theo hình thức trả trước trong một thời hạn cố định. Khi thời hạn cố định kết thúc, đăng ký của bạn sẽ chấm dứt trừ khi bạn tham gia đăng ký thời hạn cố định tiếp theo.\n\n\n\nDịch vụ cao cấp được đăng ký qua Ứng dụng của chúng tôi: Phí đăng ký. Nếu bạn đăng ký Dịch vụ cao cấp từ Ứng dụng của chúng tôi, Phí đăng ký sẽ được thanh toán hàng tháng và đăng ký của bạn sẽ tự động gia hạn vào cuối mỗi tháng và Phí đăng ký áp dụng sẽ phải trả trừ khi đăng ký của bạn bị hủy theo Mục 9.\n\n\n\nThanh toán. Vào thời điểm đăng ký Dịch vụ cao cấp, bạn sẽ được yêu cầu thanh toán Phí đăng ký bằng phương thức thanh toán do chúng tôi hoặc bộ xử lý thanh toán của chúng tôi chỉ định theo thời gian. Phương thức thanh toán có thể khác nhau tùy thuộc vào vị trí của bạn và việc bạn đăng ký Dịch vụ cao cấp thông qua Trang web hay Ứng dụng của chúng tôi.\n\n\n\nThanh toán cho Dịch vụ cao cấp đã đăng ký qua Ứng dụng của chúng tôi. Bạn có thể đăng ký Dịch vụ cao cấp từ Ứng dụng của chúng tôi (Android / iOS). Bằng cách cung cấp cho bộ xử lý thanh toán được Google Inc. hoặc Apple Inc. ủy quyền (\"Bộ xử lý thanh toán được ủy quyền\") thông tin chi tiết về phương thức thanh toán, bạn (i) cam kết rằng bạn được ủy quyền sử dụng phương thức thanh toán mà bạn đã cung cấp; (ii) cam kết rằng mọi thông tin thanh toán bạn cung cấp là đúng sự thật và chính xác; và (iii) ủy quyền cho Bộ xử lý thanh toán được ủy quyền thu phí đăng ký theo định kỳ hàng tháng cho đến khi bạn hủy đăng ký Dịch vụ cao cấp của mình theo mô tả trong Mục 9 hoặc chúng tôi chấm dứt theo các Điều khoản dịch vụ này. Bạn phải cập nhật thông tin chi tiết về phương thức thanh toán đã chọn và đảm bảo có đủ tiền để trang trải chi phí Phí đăng ký. Để thay đổi thông tin thanh toán, vui lòng tham khảo các trang sau: Android / iOS. Nếu bạn gửi thông tin cập nhật liên quan đến phương thức thanh toán của mình, bạn đồng ý cho phép Bộ xử lý thanh toán được ủy quyền sử dụng thông tin cập nhật để thu tiền từ bạn. Những thay đổi đối với thông tin thanh toán của bạn sẽ không áp dụng cho Phí đăng ký đã gửi để thanh toán.\n\n\n\nPhí của bên thứ ba. Chúng tôi hoặc bộ xử lý thanh toán của chúng tôi không chịu trách nhiệm cho bất kỳ khoản phí hoặc lệ phí nào do ngân hàng, tổ chức phát hành thẻ tín dụng hoặc thẻ ghi nợ hoặc nhà cung cấp tài khoản khác của bạn áp dụng khi thanh toán Phí đăng ký hoặc bất kỳ chi phí nào có thể phát sinh do những nỗ lực không thành công trong việc thực hiện khoản thanh toán đó. Chúng tôi hoặc bộ xử lý thanh toán của chúng tôi có thể thử lại việc thực hiện thanh toán bất kỳ lúc nào. Nếu chúng tôi không thể thực hiện thanh toán thành công, chúng tôi có thể chấm dứt hoặc tạm ngừng việc bạn sử dụng Dịch vụ cao cấp, tuy nhiên, bạn vẫn sẽ nợ chúng tôi Phí đăng ký cho đến thời điểm chấm dứt hoặc tạm ngừng và (trong trường hợp tạm ngừng) trong khoảng thời gian tài khoản của bạn bị tạm ngừng, trong phạm vi cho phép của luật hiện hành. Chúng tôi hoặc bộ xử lý thanh toán của chúng tôi có thể liên hệ với bạn nếu ngân hàng, tổ chức phát hành thẻ hoặc nhà cung cấp tài khoản khác của bạn từ chối thanh toán Phí đăng ký hoặc từ chối cho phép thanh toán định kỳ Phí đăng ký.\n\n\n\nThay đổi Phí. Chúng tôi có thể tăng hoặc giảm Phí đăng ký bất kỳ lúc nào theo quyết định riêng của chúng tôi (bao gồm cả việc đưa ra các khoản phí cho các khía cạnh của Dịch vụ cao cấp đã được cung cấp trước đó mà không mất thêm chi phí) và trong trường hợp đó, chúng tôi sẽ thông báo cho bạn trước một cách hợp lý về việc thay đổi giá có hiệu lực, chẳng hạn như bằng cách gửi cho bạn email hoặc bằng tin nhắn hiển thị thông qua Dịch vụ Tastopia. Nếu bạn không đồng ý với Phí đăng ký đã thay đổi, bạn có thể hủy đăng ký Dịch vụ cao cấp trong vòng ba mươi (30) ngày sau khi chúng tôi thông báo cho bạn về thay đổi. Nếu bạn không hủy đăng ký, thì bạn sẽ được coi là đã chấp nhận thay đổi và chúng tôi sẽ bắt đầu tính Phí đăng ký đã sửa đổi.\n\n\n\n9. HỦY DỊCH VỤ CAO CẤP\n\nHủy Dịch vụ Cao cấp Đã đăng ký qua Trang web của chúng tôi. Đăng ký Dịch vụ Cao cấp của chúng tôi phải trả phí theo hình thức trả trước trong một khoảng thời gian cố định. Sau khi bạn đã mua Đăng ký Dịch vụ Cao cấp trong một khoảng thời gian cố định, Đăng ký của bạn sẽ có hiệu lực trong khoảng thời gian đã chọn và bạn sẽ không thể hủy trừ khi chúng tôi vi phạm các Điều khoản Dịch vụ này hoặc bạn được phép hủy theo cách khác. Vào cuối thời hạn Đăng ký áp dụng, Đăng ký của bạn sẽ chấm dứt trừ khi bạn mua Đăng ký bổ sung.\n\n\n\nHủy Dịch vụ Cao cấp Đã đăng ký qua Ứng dụng của Chúng tôi. Để hủy đăng ký hàng tháng của bạn đối với Dịch vụ Cao cấp của chúng tôi, vui lòng tham khảo các trang sau: Android / iOS. Việc hủy sẽ có hiệu lực vào cuối kỳ thanh toán hàng tháng hiện tại. PHÍ ĐĂNG KÝ KHÔNG ĐƯỢC HOÀN LẠI VÀ KHÔNG CÓ HOÀN TIỀN HOẶC TÍN DỤNG CHO CÁC KỲ THANH TOÁN HÀNG THÁNG.\n\n\n\n10. CHỦ SỞ HỮU NỘI DUNG VÀ QUYỀN BẠN CẤP PHÉP\n\nChúng tôi không tuyên bố quyền sở hữu đối với bất kỳ công thức nấu ăn, hình ảnh, đồ họa, bình luận, thông tin, dữ liệu, văn bản hoặc tài liệu nào khác mà bạn tải lên hoặc đăng trên Trang web hoặc Ứng dụng của chúng tôi (\"Nội dung\").\n\n\n\nTuy nhiên, khi bạn tải Nội dung, bao gồm công thức nấu ăn, lên Trang web hoặc Ứng dụng của chúng tôi, bạn cấp cho chúng tôi quyền và giấy phép toàn cầu, miễn phí bản quyền, liên tục và có thể chuyển nhượng (mà chúng tôi cũng có thể cấp cho các chi nhánh và bên thứ ba, bao gồm những người dùng khác) để sử dụng, sao chép, tái tạo, xử lý, điều chỉnh, sửa đổi, dịch, xuất bản, truyền tải, hiển thị và phân phối (bao gồm thông qua bên thứ ba) Nội dung đó hoặc các sản phẩm phái sinh của nó, trong bất kỳ và tất cả các phương tiện hoặc phương pháp phân phối (hiện đã biết hoặc phát triển sau này) cho bất kỳ và tất cả các hoạt động kinh doanh của chúng tôi. Bạn cũng đồng ý rằng:\n\n\n\ngiấy phép này bao gồm quyền cho phép chúng tôi cung cấp, quảng bá và khai thác thương mại Nội dung được tải lên Trang web hoặc Ứng dụng của chúng tôi theo bất kỳ phương tiện, cách thức hoặc hình thức nào cho hoặc với những người dùng hoặc cá nhân khác hợp tác với chúng tôi để phân phối hoặc xuất bản Nội dung trên các phương tiện truyền thông và dịch vụ khác;\n\nnhững mục đích sử dụng bổ sung như vậy của chúng tôi, những người dùng khác của Trang web hoặc Ứng dụng của chúng tôi và những người khác hợp tác với chúng tôi để phân phối hoặc xuất bản Nội dung của bạn có thể được thực hiện mà không cần trả bất kỳ khoản bồi thường nào cho bạn đối với Nội dung mà bạn tải lên Trang web hoặc Ứng dụng của chúng tôi;\n\nbạn cho phép chúng tôi báo cáo hành vi vi phạm bản quyền thay mặt bạn cho đại lý được chỉ định, chủ sở hữu trang web, nhà cung cấp dịch vụ lưu trữ hoặc bất kỳ liên hệ phù hợp nào khác khi chúng tôi phát hiện Nội dung của bạn bị vi phạm; và\n\nbạn từ bỏ hoặc, nếu không thể, đồng ý không khẳng định tất cả các quyền đạo đức (và tất cả các quyền tương tự tại các khu vực pháp lý khác) mà bạn có hoặc sẽ có hiện tại hoặc trong tương lai liên quan đến Nội dung của bạn.\n\n11. QUYỀN SỞ HỮU TRÍ TUỆ\n\nNgoại trừ Nội dung của bạn, bao gồm công thức nấu ăn của bạn, mọi quyền sở hữu trí tuệ trong Dịch vụ Tastopia và mọi tài liệu trên Trang web hoặc Ứng dụng của chúng tôi, bao gồm thiết kế, đồ họa, văn bản, hình ảnh, phần mềm, các tệp khác cũng như lựa chọn và sắp xếp của chúng (gọi chung là “Tài liệu”) đều thuộc sở hữu của chúng tôi và/hoặc bên cấp phép của chúng tôi.\n\n\n\nChúng tôi cấp cho bạn quyền sử dụng Tài liệu trong phạm vi và chỉ trong phạm vi cần thiết để truy cập và sử dụng Dịch vụ Tastopia cho mục đích sử dụng cá nhân, phi thương mại của bạn theo các Điều khoản dịch vụ này. Mọi quyền khác được bảo lưu rõ ràng.\n\n\n\nVì thế:\n\n\n\nbạn không được sử dụng bất kỳ phần nào của Tài liệu, hoặc Trang web hoặc Ứng dụng của chúng tôi cho mục đích thương mại mà không có sự đồng ý rõ ràng từ chúng tôi và/hoặc (nếu có) bên cấp phép của chúng tôi;\n\nbạn không được sử dụng bất kỳ hình ảnh minh họa, ảnh chụp, chuỗi video hoặc âm thanh hoặc bất kỳ đồ họa nào tách biệt khỏi bất kỳ văn bản đi kèm nào; hoặc\n\nbạn không được sử dụng Tài liệu bên ngoài Trang web hoặc Ứng dụng của chúng tôi, đặc biệt là bằng cách xóa bất kỳ tư cách nào của những người đóng góp được xác định là tác giả của Tài liệu trên Trang web hoặc Ứng dụng của chúng tôi.\n\n12. QUY TẮC ỨNG XỬ\n\nBạn hứa rằng bạn sẽ không:\n\n\n\nvi phạm quyền sở hữu trí tuệ của bên thứ ba, bao gồm nhưng không giới hạn ở quyền sở hữu trí tuệ như bản quyền và nhãn hiệu của chúng tôi, người dùng khác hoặc bên thứ ba;\n\nxâm phạm quyền sở hữu, quyền riêng tư và quyền hình ảnh của chúng tôi, người dùng khác hoặc bên thứ ba;\n\ntiết lộ thông tin, chẳng hạn như tên, địa chỉ gửi thư, số điện thoại và địa chỉ email của một cá nhân cụ thể mà không được phép và qua đó bất kỳ bên thứ ba nào cũng có thể xác định được cá nhân đó;\n\nđăng ký nhiều địa chỉ email để có được nhiều tài khoản trong khi chỉ là một người dùng duy nhất;\n\nmở tài khoản thay mặt cho Người dùng đã đăng ký có tài khoản đã bị đình chỉ hoặc chấm dứt;\n\nphân biệt đối xử, quấy rối, bắt nạt, đe dọa, phỉ báng hoặc làm tổn hại đến danh tiếng và uy tín của người dùng khác hoặc bên thứ ba;\n\nthay đổi và/hoặc xóa Tài liệu được cung cấp thông qua Dịch vụ Tastopia;\n\nmạo danh chúng tôi, người dùng khác hoặc bên thứ ba (bao gồm cả việc làm giả tiêu đề email nhằm mục đích làm sai lệch nguồn gốc của tiêu đề email và danh tính của người gửi);\n\ntruyền các chương trình máy tính hoặc vi-rút có hại hoặc khiến người dùng khác hoặc bên thứ ba nhận được các chương trình hoặc vi-rút đó;\n\ntruy cập trái phép, hoặc thực hiện quét cổng, tấn công từ chối dịch vụ hoặc gửi thư rác vào các tiện ích của người dùng khác hoặc bên thứ ba hoặc các tiện ích được Dịch vụ Tastopia sử dụng (bao gồm nhưng không giới hạn ở các tiện ích viễn thông, máy tính và các thiết bị khác, cũng như phần mềm được chúng tôi sử dụng để cung cấp Dịch vụ Tastopia) và/hoặc gây ra hoặc cố gắng gây ra sự can thiệp vào việc sử dụng hoặc vận hành các tiện ích đó;\n\ntruyền, mà không được phép, email mang tính quảng cáo, khuyến mại hoặc chào hàng hoặc có tính chất gây khó chịu (bao gồm thư rác); cản trở việc nhận email của người dùng khác hoặc bên thứ ba; yêu cầu truyền email chuỗi và/hoặc truyền email chuỗi theo các yêu cầu đó;\n\nlưu hành thông tin, thiết bị và phần mềm được sử dụng nhằm mục đích vô hiệu hóa hoặc phá vỡ chức năng kiểm soát truy cập của máy chủ và các cơ sở khác;\n\nsao chép, sửa đổi, tháo rời, phân tích ngược hoặc phân tích các mẫu hoặc phần mềm có trong Tài liệu (trừ trường hợp được pháp luật cho phép và bạn đồng ý thông báo cho chúng tôi trong trường hợp đó);\n\nlấy thông tin tài khoản mà không được phép hoặc thông qua gian lận (bao gồm nhưng không giới hạn ở lừa đảo hoặc các phương pháp tương tự);\n\nsử dụng Dịch vụ Tastopia cho các hoạt động thương mại (bao gồm bất kỳ hoạt động nào được khuyến khích), vì lợi nhuận và dự đoán lợi nhuận, trừ khi đã có được sự chấp thuận trước bằng văn bản từ chúng tôi;\n\nsử dụng Dịch vụ Tastopia cho chiến dịch tranh cử hoặc các hoạt động chính trị khác;\n\nsử dụng Dịch vụ Tastopia vi phạm luật pháp và quy định hiện hành;\n\ncản trở hoạt động của Dịch vụ Tastopia hoặc cản trở việc trao đổi hoặc chia sẻ Nội dung do người dùng khác hoặc bên thứ ba đóng góp; hoặc gây thiệt hại hoặc mất mát cho chúng tôi, người dùng khác hoặc bên thứ ba bằng cách làm tổn hại đến uy tín của họ hoặc xâm phạm quyền sở hữu trí tuệ của họ;\n\ngây cản trở đáng kể đến hoạt động kinh doanh của chúng tôi thông qua các cuộc điều tra hoặc email lặp đi lặp lại, phù phiếm hoặc gây phiền nhiễu, vượt quá nghĩa vụ của chúng tôi và/hoặc không hợp lý;\n\nvi phạm Điều khoản dịch vụ; hoặc cản trở trật tự công cộng và đạo đức (bao gồm nhưng không giới hạn ở việc truyền hoặc hiển thị Nội dung có thể thúc đẩy và kích động bạo lực, hình ảnh bất hợp pháp hoặc tự tử);\n\nthiết lập liên kết đến Trang web hoặc Ứng dụng của chúng tôi để khuyến khích bất kỳ hành động nào, bao gồm cả hành động của bên thứ ba, được mô tả ở trên;\n\nvi phạm các yêu cầu khác mà chúng tôi có thể áp dụng theo thời gian theo quyết định riêng và tuyệt đối của mình; hoặc\n\nsử dụng Dịch vụ Tastopia theo cách mà Tastopia có lý do để cho là không phù hợp hoặc không thích hợp. Tastopia sẽ tham khảo các yếu tố như cách sử dụng Dịch vụ Tastopia thông thường của phần lớn người dùng và thông lệ chung của ngành khi xác định việc sử dụng đó là không phù hợp hoặc không thích hợp.\n\n13. QUÉT HÌNH ẢNH TỰ ĐỘNG\n\nVới tư cách là một tính năng tùy chọn, Tastopia có thể cung cấp tính năng phân loại hình ảnh tự động giúp bạn tải lên các hình ảnh liên quan đến thực phẩm. Nếu bạn chọn sử dụng tính năng tùy chọn này, các hình ảnh có sẵn trên thiết bị của bạn sẽ được gửi đến máy chủ của chúng tôi và được quét tự động bằng phần mềm nhận dạng hình ảnh tự động để cố gắng xác định hình ảnh nào của bạn liên quan đến thực phẩm. Các hình ảnh tạm thời được xác định là liên quan đến thực phẩm sẽ được hiển thị cho bạn trên trang riêng tư của bạn tại Ứng dụng của chúng tôi, nơi mà chỉ bạn mới có quyền truy cập. Bạn có thể xóa thủ công các hình ảnh không mong muốn được hiển thị trên trang riêng tư. Bất kỳ hình ảnh nào không được xác định là liên quan đến thực phẩm hoặc bạn đã xóa thủ công sẽ bị xóa khỏi máy chủ của Tastopia.\n\n\n\n14. TRÁCH NHIỆM VỀ NỘI DUNG\n\nBạn hoàn toàn chịu trách nhiệm về Nội dung mà bạn đăng, tải lên và/hoặc xuất bản bằng Dịch vụ Tastopia. Chúng tôi không xem xét hoặc sàng lọc bất kỳ Nội dung nào của bạn trước khi Nội dung đó xuất hiện hoặc được chia sẻ.\n\n\n\nBạn hứa rằng:\n\n\n\nbất kỳ Nội dung nào bạn đăng hoặc xuất bản đều tuân thủ các Điều khoản Dịch vụ này;\n\nbạn có quyền sử dụng, tải lên, đăng hoặc xuất bản Nội dung lên Ứng dụng hoặc Trang web của chúng tôi và cấp cho chúng tôi các giấy phép như đã nêu trong Mục 10; và\n\nviệc Tastopia sử dụng Nội dung bạn đã tải lên, đăng hoặc xuất bản sẽ không vi phạm quyền của bất kỳ bên thứ ba nào.\n\nBạn đồng ý và thừa nhận rằng:\n\n\n\nchúng tôi sẽ không chịu trách nhiệm hoặc chịu trách nhiệm pháp lý với bất kỳ bên thứ ba nào về Nội dung hoặc tính chính xác của bất kỳ Nội dung nào do bạn hoặc bất kỳ người dùng nào khác của Trang web hoặc Ứng dụng của chúng tôi đăng;\n\nchúng tôi có quyền xóa bất kỳ Nội dung nào bạn cung cấp trên Trang web hoặc Ứng dụng của chúng tôi theo quyết định riêng của chúng tôi, bao gồm; nếu theo ý kiến ​​của chúng tôi, Nội dung của bạn không tuân thủ các Điều khoản dịch vụ này hoặc nếu chúng tôi tin rằng điều đó là cần thiết để bảo vệ chúng tôi, những người dùng khác hoặc bất kỳ bên thứ ba nào; và\n\nbạn chịu toàn bộ trách nhiệm bảo mật và sao lưu Nội dung của mình.\n\n15. THAY ĐỔI CÁC ĐIỀU KHOẢN NÀY\n\nChúng tôi có thể sửa đổi các Điều khoản dịch vụ này (“Thay đổi”) bất kỳ lúc nào nếu:\n\n\n\ncó sự thay đổi trong luật pháp và quy định hiện hành;\n\ncó những thay đổi về thông số kỹ thuật hoặc hoạt động của Dịch vụ Tastopia;\n\ncó những thay đổi về chính sách nhóm Tastopia hoặc các quy định nội bộ;\n\ncó những thay đổi về thông số kỹ thuật dịch vụ hoặc chính sách của các dịch vụ bên thứ ba bên ngoài được Tastopia sử dụng hoặc kết nối với Dịch vụ Tastopia;\n\ncó những thay đổi trong môi trường kinh doanh mà Tastopia đang hoạt động;\n\ncần thiết để ứng phó với các mối đe dọa thực tế hoặc tiềm ẩn đối với doanh nghiệp của chúng tôi (chẳng hạn như các mối đe dọa về an ninh mạng) hoặc các hành vi hoặc hoạt động không mong muốn hoặc nguy hiểm trong cộng đồng của chúng tôi;\n\ncần phải làm rõ hoặc sửa đổi bất kỳ phần nào của Điều khoản dịch vụ này; hoặc\n\ncác tình huống khác, không lường trước được, có thể yêu cầu chúng tôi phải sửa đổi các Điều khoản Dịch vụ này một cách hợp lý;\n\nVui lòng kiểm tra trang này theo thời gian để lưu ý bất kỳ Thay đổi nào mà chúng tôi thực hiện, vì chúng ràng buộc bạn, trừ khi bạn chấm dứt tài khoản của mình. Chúng tôi sẽ thông báo cho bạn về các Thay đổi quan trọng, bao gồm bằng cách đăng khi bạn truy cập Trang web hoặc Ứng dụng của chúng tôi hoặc qua email đến địa chỉ email đã đăng ký khi bạn đăng ký tài khoản.\n\n\n\nNếu bạn tiếp tục sử dụng Dịch vụ Tastopia sau khi có Thay đổi, bạn đồng ý với các Thay đổi đó. Nếu bạn không chấp nhận Thay đổi: (i) nếu bạn là Khách hoặc Người dùng đã đăng ký, vui lòng ngừng sử dụng Dịch vụ Tastopia hoặc (ii) nếu bạn là người dùng Dịch vụ cao cấp, bạn phải chấm dứt đăng ký trong vòng ba mươi (30) ngày sau khi chúng tôi thông báo cho bạn về Thay đổi (hoặc bạn biết về Thay đổi, nếu sớm hơn).\n\n\n\nNếu bạn ngừng sử dụng Dịch vụ Tastopia hoặc chấm dứt Dịch vụ Cao cấp (nếu có) theo đoạn trước, các Thay đổi có liên quan sẽ không ràng buộc bạn. Xin lưu ý rằng, ngay cả khi các Thay đổi không ràng buộc bạn, nếu bạn không chấm dứt đăng ký của mình trước ngày gia hạn tiếp theo, bạn sẽ bị tính phí đăng ký cho dịch vụ của tháng tiếp theo.\n\n\n\nCác Điều khoản dịch vụ này được cập nhật lần cuối vào ngày 1 tháng 11. Chúng tôi đã cập nhật Điều khoản dịch vụ thành:\n\n\n\nsửa đổi đơn vị ký kết hợp đồng từ Tastopia Limited thành chi nhánh đã đăng ký tại Vương quốc Anh của Tastopia, Inc.; và\n\nđưa ra một số luật chung về người tiêu dùng và cập nhật cách diễn đạt rõ ràng hơn (bao gồm sửa đổi Mục 19 và 23, và Mục 24 mới).\n\n16. THAY ĐỔI TRANG WEB HOẶC ỨNG DỤNG VÀ DỊCH VỤ tastopia CỦA CHÚNG TÔI\n\nChúng tôi có thể cập nhật Trang web hoặc Ứng dụng của mình theo thời gian và có thể thay đổi Tài liệu bất kỳ lúc nào. Chúng tôi cũng có quyền thay đổi và cải thiện các tính năng và chức năng của Dịch vụ Tastopia bất kỳ lúc nào và theo quyết định riêng của chúng tôi. Điều này bao gồm việc thêm, sửa đổi hoặc xóa các tính năng và chức năng cụ thể của Dịch vụ Tastopia. Nếu chúng tôi có ý định xóa bất kỳ chức năng quan trọng nào của Dịch vụ Cao cấp mà bạn đăng ký, chúng tôi sẽ thông báo trước cho bạn một cách hợp lý. Xin lưu ý rằng bất kỳ Tài liệu nào trên Trang web hoặc Ứng dụng của chúng tôi có thể lỗi thời tại bất kỳ thời điểm nào và chúng tôi không có nghĩa vụ phải cập nhật.\n\n\n\n17. TẠM DỪNG HOẶC VĨNH VIỄN DỊCH VỤ tastopia\n\nChúng tôi không đảm bảo rằng Dịch vụ Tastopia hoặc bất kỳ Tài liệu nào trên Trang web và Ứng dụng sẽ luôn khả dụng hoặc không bị gián đoạn. Chúng tôi có thể tạm ngừng, thu hồi hoặc ngừng toàn bộ hoặc bất kỳ phần nào của Dịch vụ Tastopia mà không cần thông báo. Chúng tôi sẽ không chịu trách nhiệm với bạn nếu vì bất kỳ lý do nào, Dịch vụ Tastopia của chúng tôi không khả dụng tại bất kỳ thời điểm nào hoặc trong bất kỳ khoảng thời gian nào.\n\n\n\nChúng tôi cũng có thể tạm ngừng hoặc hủy quyền truy cập hoặc quyền sử dụng Dịch vụ Tastopia của bạn khi chúng tôi thu hồi chúng. Trong trường hợp đó, chúng tôi sẽ thông báo cho bạn trước một thời gian hợp lý.\n\n\n\n18. HẠN CHẾ, TẠM DỪNG HOẶC HỦY BỎ VIỆC SỬ DỤNG\n\nChúng tôi có thể hạn chế, đình chỉ, thu hồi hoặc chấm dứt quyền truy cập hoặc quyền sử dụng Dịch vụ Tastopia của bạn mà không cần thông báo trước trong các trường hợp sau. Khi có thể, chúng tôi sẽ thông báo cho bạn về ý định thực hiện việc này tuy nhiên:\n\n\n\nbạn đã vi phạm các Điều khoản dịch vụ này;\n\nbạn đã cung cấp cho chúng tôi thông tin sai lệch;\n\nbạn đang sử dụng Dịch vụ Tastopia một cách bất hợp pháp hoặc vi phạm quyền của bên thứ ba;\n\nbạn chưa thanh toán Phí đăng ký cho Dịch vụ cao cấp, chúng tôi đã nhắc nhở bạn về điều này và bạn vẫn chưa thanh toán;\n\nđiều này là cần thiết để bảo vệ bản thân chúng tôi, người dùng khác hoặc bất kỳ bên thứ ba nào;\n\ncó khả năng các bên thứ ba sẽ đưa ra khiếu nại hoặc tố tụng chống lại chúng tôi do những tình huống liên quan đến việc bạn sử dụng Dịch vụ Tastopia;\n\nkhông thể liên lạc với bạn qua điện thoại, fax và/hoặc email;\n\nđó là trường hợp khẩn cấp; và/hoặc\n\nđiều này là cần thiết để vận hành Dịch vụ Tastopia.\n\nViệc hạn chế, đình chỉ, thu hồi hoặc ngừng cung cấp Dịch vụ Tastopia có thể dẫn đến mất quyền truy cập và sử dụng vĩnh viễn một số khía cạnh nhất định của dịch vụ, bao gồm cả Nội dung do bạn tải lên, ngay cả khi sau này bạn đăng ký lại hoặc đăng ký lại Dịch vụ Tastopia.\n\n\n\n19. GIỚI HẠN TRÁCH NHIỆM CỦA CHÚNG TÔI\n\nKhông có điều khoản nào trong Điều khoản dịch vụ này loại trừ hoặc hạn chế trách nhiệm của chúng tôi đối với trường hợp tử vong hoặc thương tích cá nhân phát sinh do hành vi bất cẩn, gian lận hoặc trình bày sai sự thật mang tính gian dối của chúng tôi.\n\n\n\nChúng tôi sẽ không chịu trách nhiệm với bạn về bất kỳ tổn thất hoặc thiệt hại nào mà bạn phải chịu: (i) không thể lường trước một cách hợp lý tại thời điểm bạn chấp nhận các Điều khoản dịch vụ này - tổn thất hoặc thiệt hại là có thể lường trước một cách hợp lý nếu tại thời điểm bạn chấp nhận các Điều khoản dịch vụ này, điều đó là hiển nhiên rằng nó có thể xảy ra hoặc cả bạn và chúng tôi đều biết rằng nó có thể xảy ra, ví dụ, nếu bạn và chúng tôi đã thảo luận về điều đó; hoặc (ii) không phải do chúng tôi vi phạm một điều khoản nào đó của các Điều khoản dịch vụ này hoặc bất kỳ lỗi nào khác của chúng tôi.\n\n\n\nChúng tôi cũng sẽ không chịu trách nhiệm với bạn về:\n\n\n\nbất kỳ lỗi hoặc thiếu sót nào trong bất kỳ công thức hoặc Tài liệu nào khác;\n\nviệc sử dụng hoặc dựa vào bất kỳ Tài liệu nào được hiển thị trên Trang web hoặc Ứng dụng của chúng tôi;\n\nbất kỳ truy cập hoặc sử dụng trái phép nào vào máy chủ an toàn của chúng tôi hoặc bất kỳ và tất cả thông tin cá nhân không được bảo mật;\n\nbất kỳ sự gián đoạn hoặc chấm dứt việc truyền tải đến hoặc đi từ Trang web hoặc Ứng dụng của chúng tôi;\n\nvi-rút, tấn công từ chối dịch vụ phân tán hoặc các tài liệu gây hại về mặt công nghệ khác có thể lây nhiễm vào thiết bị máy tính, chương trình máy tính, dữ liệu hoặc tài liệu độc quyền khác của bạn do bạn sử dụng Trang web hoặc Ứng dụng của chúng tôi hoặc do bạn tải xuống bất kỳ Tài liệu nào trên đó hoặc trên bất kỳ trang web nào được liên kết với nó;\n\nnội dung của các trang web được liên kết trên Trang web hoặc Ứng dụng của chúng tôi; hoặc\n\nyêu cầu, khẳng định, khiếu nại, vụ kiện, hành động hoặc thủ tục tố tụng khác của bên thứ ba được người dùng khác đưa ra chống lại bạn, cáo buộc rằng Nội dung của bạn vi phạm bất kỳ quyền sở hữu trí tuệ nào của bên thứ ba hoặc chiếm dụng thông tin bí mật của bên thứ ba;\n\nTrách nhiệm hữu hạn đối với Người dùng đã đăng ký Dịch vụ cao cấp Chúng tôi sẽ chỉ chịu trách nhiệm với Người dùng đã đăng ký Dịch vụ cao cấp lên đến tổng giới hạn tối đa của Phí đăng ký mà Người dùng đã đăng ký đó đã thanh toán cho chúng tôi liên quan đến Dịch vụ cao cấp.\n\n\n\n20. KẾT NỐI INTERNET\n\nĐể sử dụng Trang web và Ứng dụng của chúng tôi, thiết bị của bạn sẽ cần kết nối internet. Bạn chịu hoàn toàn trách nhiệm về việc tự chi trả cho bất kỳ phần cứng, phần mềm và dịch vụ của bên thứ ba nào (chẳng hạn như gói dịch vụ không dây được mua thông qua nhà cung cấp dịch vụ viễn thông) cần thiết để kết nối thiết bị của bạn với internet, bao gồm bất kỳ khoản phí truyền dữ liệu nào có thể được áp dụng bởi nhà cung cấp dịch vụ bạn chọn và nếu bạn chọn tải lên lượng dữ liệu lớn như tệp hình ảnh, thì có thể là đáng kể.\n\n\n\n21. LIÊN KẾT VÀ TÀI NGUYÊN CỦA BÊN THỨ BA TRÊN TRANG WEB HOẶC ỨNG DỤNG CỦA CHÚNG TÔI\n\nKhi Trang web hoặc Ứng dụng của chúng tôi chứa các liên kết đến các trang web và tài nguyên khác do bên thứ ba cung cấp, các liên kết này chỉ được cung cấp để bạn tham khảo. Chúng tôi không kiểm soát nội dung của các trang web hoặc tài nguyên đó.\n\n\n\n22. QUYỀN CỦA BÊN THỨ BA\n\nCác bên có ý định rằng không có cá nhân nào không phải là bên tham gia vào các điều khoản này sẽ có bất kỳ quyền nào theo Đạo luật Hợp đồng (Quyền của Bên thứ ba) năm 1999 hoặc theo cách khác để thực thi bất kỳ điều khoản nào của Điều khoản Dịch vụ này. Không cần sự đồng ý của bất kỳ bên thứ ba nào để thay đổi các điều khoản này.\n\n\n\n23. LUẬT ÁP DỤNG VÀ QUYỀN HẠN\n\nChúng tôi sẽ cố gắng hết sức để giải quyết mọi tranh chấp liên quan đến Điều khoản dịch vụ này.\n\n\n\nCác Điều khoản dịch vụ này, nội dung và hình thức của chúng, được điều chỉnh bởi luật pháp Anh. Tuy nhiên, nếu bạn là người tiêu dùng và cư trú tại bất kỳ quốc gia nào khác thuộc Liên minh châu Âu, bạn sẽ được hưởng lợi từ, và nếu bạn là người tiêu dùng và cư trú tại bất kỳ quốc gia nào khác không thuộc Liên minh châu Âu, bạn có thể được hưởng lợi từ, các điều khoản bắt buộc và các quyền hợp pháp có sẵn cho bạn theo luật pháp của quốc gia đó. Không có điều khoản nào trong các Điều khoản dịch vụ này ảnh hưởng đến quyền của bạn với tư cách là người tiêu dùng để dựa vào các điều khoản bắt buộc và quyền hợp pháp của luật pháp địa phương này.\n\n\n\nBạn và chúng tôi đều đồng ý rằng tòa án Anh và xứ Wales sẽ có thẩm quyền không độc quyền. Tuy nhiên, nếu bạn là người tiêu dùng và cư trú tại bất kỳ quốc gia nào khác, bạn và chúng tôi cũng có thể tiến hành tố tụng tại quốc gia đó.\n\n\n\n24. ODR\n\nỦy ban EU đã cung cấp một nền tảng internet để giải quyết tranh chấp trực tuyến (“Nền tảng ODR”). Nền tảng ODR này đóng vai trò là điểm cho giải quyết tranh chấp thay thế liên quan đến các nghĩa vụ hợp đồng từ các hợp đồng trực tuyến. Nền tảng ODR có thể truy cập tại liên kết sau: http://ec.europa.eu/consumers/odr.\n\n\n\n25. THƯƠNG HIỆU\n\n“tastopia” và logo tastopia là nhãn hiệu đã đăng ký của Tastopia Inc. tại Nhật Bản, Vương quốc Anh và một số khu vực pháp lý khác.\n\n\n\n26. LIÊN HỆ VỚI CHÚNG TÔI\n\nĐể liên hệ với chúng tôi, vui lòng gửi email đến info-vn@tastopia.com\n\n\n\nNếu bạn đang cư trú tại một quốc gia thuộc Liên minh Châu Âu:\n\nNếu bạn đã bắt đầu Dịch vụ cao cấp, bạn có quyền thay đổi quyết định và được hoàn lại toàn bộ tiền trong vòng mười bốn (14) ngày kể từ lần đăng ký đầu tiên, bằng cách gửi email cho chúng tôi theo địa chỉ info-vn@tastopia.com với nội dung sau:\n\n\n\nTôi xin thông báo rằng tôi sẽ hủy hợp đồng đăng ký Dịch vụ cao cấp đã đặt vào ngày [ ](ngày)\n\nTên người tiêu dùng:\n\nTên người dùng:\n\nĐịa chỉ của người tiêu dùng:\n\nNgày:\n\n\n\nNếu bạn đang cư trú tại Tây Ban Nha:\n\nBạn cũng có thể liên hệ với chúng tôi qua số điện thoại: 965225615\n\nGiấy phép về Nội dung được tải lên mà bạn cấp cho chúng tôi theo Mục 10 sẽ có hiệu lực trong thời hạn hiệu lực của các quyền theo bất kỳ luật hiện hành nào.\n\nĐoạn (iv) trong Mục 10 không áp dụng và được coi là đã bị xóa.\n\nBạn có thể in và tải xuống các Điều khoản dịch vụ này để hỗ trợ vĩnh viễn bất cứ lúc nào.\n\nNếu bạn đang cư trú tại Hoa Kỳ:\n\nTastopia tuân thủ Đạo luật Bản quyền Thiên niên kỷ Kỹ thuật số (17 USC §512). Nếu bạn tin rằng bất kỳ tài liệu nào trên Trang web của chúng tôi vi phạm bản quyền của bạn, vui lòng thông báo cho đại lý được chỉ định của chúng tôi theo địa chỉ sau: tastopia-legal@tastopia.com.\n\n\n\nThông báo của bạn cho đại lý của chúng tôi phải bao gồm mô tả về tác phẩm mà bạn cho rằng đã bị vi phạm; vị trí trên Trang web của chúng tôi nơi chúng tôi có thể tìm thấy tài liệu vi phạm; thông tin liên lạc của bạn bao gồm tên, địa chỉ, số điện thoại và địa chỉ email; và tuyên bố của bạn, được ký dưới hình phạt về tội khai man, rằng bạn là chủ sở hữu bản quyền và bạn cho rằng việc sử dụng tài liệu được báo cáo là trái phép.\n\n\n\nNếu bạn đang cư trú tại Ấn Độ:\n\nBạn cũng có thể liên hệ với chúng tôi qua email tại info-in@tastopia.com.\n\n\n\nT&C này là một hồ sơ điện tử theo Đạo luật Công nghệ thông tin năm 2000 (đã sửa đổi/ban hành lại) và các quy định theo đó, và được công bố theo các điều khoản của Quy tắc 3 (1) của Quy tắc Công nghệ thông tin (Hướng dẫn dành cho người trung gian và Bộ luật đạo đức truyền thông kỹ thuật số), năm 2021, trong đó yêu cầu công bố các quy tắc và quy định, chính sách bảo mật và điều khoản sử dụng để truy cập hoặc sử dụng Ứng dụng. Hồ sơ điện tử này được tạo bởi hệ thống máy tính và không yêu cầu bất kỳ chữ ký vật lý hoặc chữ ký số nào.\n\n\n\nVề các Điều khoản dịch vụ này\n\nNếu bất kỳ điều khoản nào hoặc một phần điều khoản nào của Điều khoản dịch vụ này bị tòa án hoặc cơ quan quản lý tuyên bố là không thể thi hành, thì các điều khoản khác vẫn tiếp tục được áp dụng.\n\n\n\nNếu bạn hoặc chúng tôi vi phạm các Điều khoản dịch vụ này và bạn hoặc chúng tôi không có hành động nào chống lại bên kia, bạn hoặc chúng tôi vẫn có quyền sử dụng các quyền và biện pháp khắc phục của mình trong bất kỳ tình huống nào khác mà bạn hoặc chúng tôi vi phạm các Điều khoản dịch vụ này.\n\n\n\nCảm ơn bạn đã sử dụng Dịch vụ Tastopia.\n"
  },
  "privacy": {
    "title": "Chính sách quyền riêng tư",
    "content": "Có hiệu lực từ ngày 01 tháng 11 năm 2018\n\nVUI LÒNG ĐỌC KỸ CÁC ĐIỀU KHOẢN VÀ ĐIỀU KIỆN NÀY TRƯỚC KHI SỬ DỤNG TRANG WEB HOẶC ỨNG DỤNG NÀY\n\n\n\nCác điều khoản dịch vụ này (“Điều khoản dịch vụ”) (cùng với các tài liệu mà chúng tham chiếu đến) cho bạn biết các điều khoản mà bạn có thể sử dụng trang web của Tastopia (“Trang web”) hoặc ứng dụng di động (“Ứng dụng”). Việc sử dụng Trang web hoặc Ứng dụng bao gồm truy cập, duyệt hoặc đăng ký để sử dụng Trang web hoặc Ứng dụng.\n\n\n\nTrang web và Ứng dụng này được điều hành bởi chi nhánh đã đăng ký tại Vương quốc Anh của Tastopia Inc., một công ty được đăng ký tại 4-20-3 Ebisu, Shibuya-ku, Tokyo, Nhật Bản (\"chúng tôi\", \"của chúng tôi\" hoặc \"Tastopia\") và các công ty liên kết (là các thực thể kiểm soát, được kiểm soát bởi hoặc dưới sự kiểm soát chung với Tastopia).\n\n\n\nBằng cách sử dụng Trang web hoặc Ứng dụng của chúng tôi, bạn xác nhận rằng bạn chấp nhận và đồng ý tuân thủ các Điều khoản dịch vụ được nêu dưới đây. Nếu bạn không đồng ý với các Điều khoản dịch vụ này, bạn không được sử dụng Trang web hoặc Ứng dụng của chúng tôi. Chúng tôi khuyên bạn nên giữ một bản sao của các Điều khoản dịch vụ này để tham khảo trong tương lai.\n\n\n\n1. CHÍNH SÁCH BỔ SUNG\n\nCác chính sách bổ sung sau đây cũng áp dụng khi bạn sử dụng Trang web hoặc Ứng dụng của chúng tôi:\n\n\n\nChính sách bảo mật của chúng tôi, giải thích thông tin cá nhân nào chúng tôi thu thập, lý do chúng tôi thu thập, cách chúng tôi sử dụng thông tin, các biện pháp kiểm soát bạn có đối với thông tin cá nhân của mình và các quy trình chúng tôi áp dụng để bảo vệ quyền riêng tư của bạn. Chính sách này áp dụng cho thông tin cá nhân chúng tôi thu thập thông qua Trang web và Ứng dụng. Vui lòng đảm bảo rằng bạn đọc kỹ Chính sách bảo mật của chúng tôi trước khi sử dụng Trang web hoặc Ứng dụng.\n\nNguyên tắc cộng đồng của chúng tôi, nêu rõ các cách sử dụng được phép và bị cấm đối với Trang web hoặc Ứng dụng của chúng tôi. Các Nguyên tắc cộng đồng này là một phần của Điều khoản dịch vụ này, do đó, các tham chiếu đến Điều khoản dịch vụ bao gồm chúng.\n\n2. THÔNG TIN VỀ CHÚNG TÔI\n\nChúng tôi là chi nhánh đã đăng ký tại Vương quốc Anh của Tastopia Inc., một công ty được đăng ký tại 4-20-3 Ebisu, Shibuya-ku, Tokyo, Nhật Bản. Chi nhánh có văn phòng tại Silversmiths 1 – 3 Broad Plain, Bristol, BS2 0JP, Vương quốc Anh.\n\n\n\nNếu bạn có bất kỳ câu hỏi hoặc khiếu nại nào về Trang web hoặc Ứng dụng của chúng tôi hoặc về bất kỳ khía cạnh nào về Tastopia, vui lòng liên hệ với chúng tôi theo địa chỉ: info-vn@tastopia.com\n\n\n\n3. THÔNG TIN VỀ TRANG WEB VÀ ỨNG DỤNG CỦA CHÚNG TÔI\n\nTrang web và Ứng dụng của chúng tôi cung cấp cho bạn khả năng chia sẻ công thức nấu ăn với những người dùng khác trên Trang web và Ứng dụng của chúng tôi và duyệt công thức nấu ăn của những người dùng khác (Dịch vụ Tastopia). Ngoại trừ các Dịch vụ Cao cấp tùy chọn mà chúng tôi có thể cung cấp (xem Mục 7), Dịch vụ Tastopia được cung cấp miễn phí.\n\n\n\nTrang web của chúng tôi được thiết kế để hoạt động trên các trình duyệt web hiện đại, các hệ điều hành và nền tảng chính. Các tính năng và khả năng tương thích có thể khác nhau giữa một số trình duyệt web, hệ điều hành và nền tảng\n\n\n\nChúng tôi có thể sử dụng nhà cung cấp dịch vụ bên thứ ba để cung cấp Dịch vụ Tastopia hoặc để thực hiện nghĩa vụ của chúng tôi theo các Điều khoản dịch vụ này.\n\n\n\nChúng tôi không đảm bảo rằng Trang web hoặc Ứng dụng của chúng tôi, bất kỳ nội dung nào trên đó hoặc các dịch vụ do các nhà cung cấp dịch vụ bên thứ ba cung cấp sẽ không có lỗi hoặc thiếu sót.\n\n\n\n4. THÔNG TIN QUAN TRỌNG VỀ CÔNG THỨC\n\nTất cả các công thức nấu ăn trên Trang web hoặc Ứng dụng của chúng tôi chỉ được cung cấp cho mục đích thông tin chung và được những người dùng khác, như bạn, đăng tải chứ không phải Tastopia. Tastopia không sàng lọc hoặc kiểm tra các công thức nấu ăn trước khi đăng tải, do đó có thể có một số công thức, nguyên liệu hoặc phương pháp nấu ăn không phù hợp, không chính xác hoặc không an toàn. Các công thức nấu ăn, bình luận và thông tin khác được cung cấp trên Trang web hoặc Ứng dụng của chúng tôi không nhằm mục đích đưa ra lời khuyên mà bạn nên dựa vào, và bất kỳ việc sử dụng hoặc dựa vào bất kỳ công thức nấu ăn nào hoặc nội dung khác được cung cấp trên Trang web hoặc Ứng dụng của chúng tôi đều do bạn tự chịu rủi ro.\n\n\n\nTastopia không đưa ra bất kỳ tuyên bố nào, dù là rõ ràng hay ngụ ý, về tính chính xác, chất lượng, sự an toàn hoặc tính phù hợp của các công thức nấu ăn được công bố trên Dịch vụ Tastopia.\n\n\n\nVì thế:\n\n\n\nbạn nên xác minh bất kỳ thành phần hoặc phương pháp bất thường hoặc mới lạ nào trong công thức bằng cách tham khảo các nguồn khác;\n\nbạn phải tuân thủ mọi thông báo hoặc bản tin về an toàn thực phẩm do chính quyền địa phương của bạn ban hành và bạn không nên mong đợi Dịch vụ Tastopia ghi nhận hoặc giải thích các rủi ro có trong quá trình chế biến thực phẩm, phương pháp hoặc kỹ thuật nấu nướng hoặc tiêu thụ một số loại thực phẩm nhất định; và\n\nnếu bạn không phải là một đầu bếp có kinh nghiệm, chúng tôi khuyên bạn nên xin hướng dẫn từ một đầu bếp có kinh nghiệm hoặc một cơ quan có thẩm quyền khác khi sử dụng các công thức nấu ăn từ Dịch vụ Tastopia, đặc biệt là về vấn đề sức khỏe và an toàn.\n\nNếu bạn có bất kỳ bình luận hoặc lo ngại nào về bất kỳ công thức nấu ăn hoặc nội dung nào khác trên Dịch vụ Tastopia hoặc nếu bạn tin rằng tác phẩm có bản quyền của mình đã bị vi phạm hoặc biết về tài liệu vi phạm, bất hợp pháp hoặc không phù hợp khác, vui lòng liên hệ với chúng tôi theo địa chỉ: info-vn@tastopia.com\n\n\n\n5. ĐĂNG KÝ NGƯỜI DÙNG\n\nLiên quan đến Trang web của chúng tôi, bạn có thể truy cập và xem các công thức nấu ăn mà không cần đăng ký với tư cách là khách (“Khách”). Tuy nhiên, bạn sẽ có quyền truy cập vào nhiều tính năng hơn của Dịch vụ Tastopia nếu bạn tạo tài khoản thông qua đăng ký. Nếu bạn muốn đăng ký tài khoản để sử dụng Dịch vụ Tastopia, bạn sẽ phải hoàn thành thông tin tài khoản bắt buộc theo yêu cầu của chúng tôi thông qua việc gửi đơn đăng ký theo định dạng mà chúng tôi có thể chỉ định hoặc đăng ký bằng tài khoản của bên thứ ba (ví dụ: Facebook, Google).\n\n\n\nChúng tôi sẽ tiến hành các bước kiểm tra cần thiết về quá trình đăng ký của bạn trước hoặc sau quá trình đăng ký và sau khi chúng tôi chấp nhận, bạn sẽ được đăng ký là người dùng đã đăng ký (“Người dùng đã đăng ký”).\n\n\n\nChúng tôi có quyền đình chỉ, thu hồi hoặc ngừng tài khoản, thông tin tài khoản hoặc mật khẩu của bạn trong các trường hợp sau. Khi có thể, chúng tôi sẽ thông báo cho bạn về ý định thực hiện việc này và cho bạn cơ hội kháng cáo:\n\n\n\nbạn không tồn tại;\n\nbạn không có địa chỉ email có thể nhận email;\n\nbạn vi phạm các Điều khoản dịch vụ này;\n\nbạn đã hoặc có vẻ như đã cố ý cung cấp thông tin sai lệch cho chúng tôi;\n\nbạn là trẻ vị thành niên và chưa gửi thông tin tài khoản với sự chấp thuận của cha mẹ hoặc người giám hộ;\n\nđể ứng phó với các mối đe dọa thực tế hoặc tiềm ẩn đối với doanh nghiệp của chúng tôi (chẳng hạn như các mối đe dọa về an ninh mạng) hoặc các hành vi hoặc hoạt động không mong muốn hoặc nguy hiểm trong cộng đồng của chúng tôi; hoặc\n\nvì bất kỳ lý do nào được nêu trong Mục 18 dưới đây.\n\n6. TÀI KHOẢN VÀ MẬT KHẨU CỦA BẠN\n\nNếu bạn chọn trở thành Người dùng đã đăng ký, bạn phải coi thông tin tài khoản của mình là bí mật. Bạn không được tiết lộ thông tin này cho bất kỳ bên thứ ba nào. Bạn chấp nhận toàn bộ trách nhiệm và nghĩa vụ đối với mọi hoạt động diễn ra trong tài khoản của bạn, trừ khi đó là lỗi của chúng tôi.\n\n\n\nNếu bạn biết hoặc nghi ngờ rằng bất kỳ ai khác ngoài bạn biết tài khoản của bạn, bạn phải thông báo ngay cho chúng tôi theo địa chỉ info-vn@tastopia.com\n\n\n\n7. DỊCH VỤ CAO CẤP\n\nTính khả dụng. Chúng tôi có thể cung cấp dịch vụ tùy chọn tính phí đăng ký (“Dịch vụ cao cấp”) hướng đến một số quốc gia nhất định. Nếu Dịch vụ cao cấp khả dụng ở khu vực của bạn, dịch vụ này có thể khả dụng trên Trang web của chúng tôi (“Dịch vụ web cao cấp”) và/hoặc Ứng dụng (“Dịch vụ ứng dụng cao cấp”) hoặc cả hai.\n\n\n\nSử dụng. Bất kể bạn có đăng ký Dịch vụ cao cấp thông qua Trang web hay Ứng dụng của chúng tôi hay không, bạn vẫn có thể sử dụng Dịch vụ cao cấp và các tính năng của dịch vụ này trên cả Dịch vụ web cao cấp và Dịch vụ ứng dụng cao cấp khi có tại quốc gia hoặc khu vực của bạn. Tuy nhiên, các tính năng và chức năng có sẵn có thể khác nhau tùy thuộc vào việc bạn đang sử dụng Dịch vụ web cao cấp hay Dịch vụ ứng dụng cao cấp.\n\n\n\n8. PHÍ DỊCH VỤ CAO CẤP\n\nPhí đăng ký. Nếu Dịch vụ cao cấp khả dụng với bạn, phí cho Dịch vụ cao cấp sẽ được nêu trên Trang web hoặc trong Ứng dụng của chúng tôi (“Phí đăng ký”). Phí đăng ký có thể thay đổi tùy theo quốc gia mà Dịch vụ cao cấp hướng đến và tùy thuộc vào việc bạn đăng ký Dịch vụ cao cấp thông qua Trang web hay Ứng dụng của chúng tôi. Nếu đăng ký thông qua Ứng dụng của chúng tôi, Phí đăng ký cũng có thể thay đổi tùy thuộc vào việc bạn sử dụng nền tảng iOS hay Android. Phí đăng ký cho Dịch vụ cao cấp được thanh toán như sau:\n\n\n\nDịch vụ cao cấp được đăng ký qua trang web của chúng tôi: Phí đăng ký. Nếu bạn đăng ký Dịch vụ cao cấp qua trang web của chúng tôi, Phí đăng ký sẽ được thanh toán theo hình thức trả trước trong một thời hạn cố định. Khi thời hạn cố định kết thúc, đăng ký của bạn sẽ chấm dứt trừ khi bạn tham gia đăng ký thời hạn cố định tiếp theo.\n\n\n\nDịch vụ cao cấp được đăng ký qua Ứng dụng của chúng tôi: Phí đăng ký. Nếu bạn đăng ký Dịch vụ cao cấp từ Ứng dụng của chúng tôi, Phí đăng ký sẽ được thanh toán hàng tháng và đăng ký của bạn sẽ tự động gia hạn vào cuối mỗi tháng và Phí đăng ký áp dụng sẽ phải trả trừ khi đăng ký của bạn bị hủy theo Mục 9.\n\n\n\nThanh toán. Vào thời điểm đăng ký Dịch vụ cao cấp, bạn sẽ được yêu cầu thanh toán Phí đăng ký bằng phương thức thanh toán do chúng tôi hoặc bộ xử lý thanh toán của chúng tôi chỉ định theo thời gian. Phương thức thanh toán có thể khác nhau tùy thuộc vào vị trí của bạn và việc bạn đăng ký Dịch vụ cao cấp thông qua Trang web hay Ứng dụng của chúng tôi.\n\n\n\nThanh toán cho Dịch vụ cao cấp đã đăng ký qua Ứng dụng của chúng tôi. Bạn có thể đăng ký Dịch vụ cao cấp từ Ứng dụng của chúng tôi (Android / iOS). Bằng cách cung cấp cho bộ xử lý thanh toán được Google Inc. hoặc Apple Inc. ủy quyền (\"Bộ xử lý thanh toán được ủy quyền\") thông tin chi tiết về phương thức thanh toán, bạn (i) cam kết rằng bạn được ủy quyền sử dụng phương thức thanh toán mà bạn đã cung cấp; (ii) cam kết rằng mọi thông tin thanh toán bạn cung cấp là đúng sự thật và chính xác; và (iii) ủy quyền cho Bộ xử lý thanh toán được ủy quyền thu phí đăng ký theo định kỳ hàng tháng cho đến khi bạn hủy đăng ký Dịch vụ cao cấp của mình theo mô tả trong Mục 9 hoặc chúng tôi chấm dứt theo các Điều khoản dịch vụ này. Bạn phải cập nhật thông tin chi tiết về phương thức thanh toán đã chọn và đảm bảo có đủ tiền để trang trải chi phí Phí đăng ký. Để thay đổi thông tin thanh toán, vui lòng tham khảo các trang sau: Android / iOS. Nếu bạn gửi thông tin cập nhật liên quan đến phương thức thanh toán của mình, bạn đồng ý cho phép Bộ xử lý thanh toán được ủy quyền sử dụng thông tin cập nhật để thu tiền từ bạn. Những thay đổi đối với thông tin thanh toán của bạn sẽ không áp dụng cho Phí đăng ký đã gửi để thanh toán.\n\n\n\nPhí của bên thứ ba. Chúng tôi hoặc bộ xử lý thanh toán của chúng tôi không chịu trách nhiệm cho bất kỳ khoản phí hoặc lệ phí nào do ngân hàng, tổ chức phát hành thẻ tín dụng hoặc thẻ ghi nợ hoặc nhà cung cấp tài khoản khác của bạn áp dụng khi thanh toán Phí đăng ký hoặc bất kỳ chi phí nào có thể phát sinh do những nỗ lực không thành công trong việc thực hiện khoản thanh toán đó. Chúng tôi hoặc bộ xử lý thanh toán của chúng tôi có thể thử lại việc thực hiện thanh toán bất kỳ lúc nào. Nếu chúng tôi không thể thực hiện thanh toán thành công, chúng tôi có thể chấm dứt hoặc tạm ngừng việc bạn sử dụng Dịch vụ cao cấp, tuy nhiên, bạn vẫn sẽ nợ chúng tôi Phí đăng ký cho đến thời điểm chấm dứt hoặc tạm ngừng và (trong trường hợp tạm ngừng) trong khoảng thời gian tài khoản của bạn bị tạm ngừng, trong phạm vi cho phép của luật hiện hành. Chúng tôi hoặc bộ xử lý thanh toán của chúng tôi có thể liên hệ với bạn nếu ngân hàng, tổ chức phát hành thẻ hoặc nhà cung cấp tài khoản khác của bạn từ chối thanh toán Phí đăng ký hoặc từ chối cho phép thanh toán định kỳ Phí đăng ký.\n\n\n\nThay đổi Phí. Chúng tôi có thể tăng hoặc giảm Phí đăng ký bất kỳ lúc nào theo quyết định riêng của chúng tôi (bao gồm cả việc đưa ra các khoản phí cho các khía cạnh của Dịch vụ cao cấp đã được cung cấp trước đó mà không mất thêm chi phí) và trong trường hợp đó, chúng tôi sẽ thông báo cho bạn trước một cách hợp lý về việc thay đổi giá có hiệu lực, chẳng hạn như bằng cách gửi cho bạn email hoặc bằng tin nhắn hiển thị thông qua Dịch vụ Tastopia. Nếu bạn không đồng ý với Phí đăng ký đã thay đổi, bạn có thể hủy đăng ký Dịch vụ cao cấp trong vòng ba mươi (30) ngày sau khi chúng tôi thông báo cho bạn về thay đổi. Nếu bạn không hủy đăng ký, thì bạn sẽ được coi là đã chấp nhận thay đổi và chúng tôi sẽ bắt đầu tính Phí đăng ký đã sửa đổi.\n\n\n\n9. HỦY DỊCH VỤ CAO CẤP\n\nHủy Dịch vụ Cao cấp Đã đăng ký qua Trang web của chúng tôi. Đăng ký Dịch vụ Cao cấp của chúng tôi phải trả phí theo hình thức trả trước trong một khoảng thời gian cố định. Sau khi bạn đã mua Đăng ký Dịch vụ Cao cấp trong một khoảng thời gian cố định, Đăng ký của bạn sẽ có hiệu lực trong khoảng thời gian đã chọn và bạn sẽ không thể hủy trừ khi chúng tôi vi phạm các Điều khoản Dịch vụ này hoặc bạn được phép hủy theo cách khác. Vào cuối thời hạn Đăng ký áp dụng, Đăng ký của bạn sẽ chấm dứt trừ khi bạn mua Đăng ký bổ sung.\n\n\n\nHủy Dịch vụ Cao cấp Đã đăng ký qua Ứng dụng của Chúng tôi. Để hủy đăng ký hàng tháng của bạn đối với Dịch vụ Cao cấp của chúng tôi, vui lòng tham khảo các trang sau: Android / iOS. Việc hủy sẽ có hiệu lực vào cuối kỳ thanh toán hàng tháng hiện tại. PHÍ ĐĂNG KÝ KHÔNG ĐƯỢC HOÀN LẠI VÀ KHÔNG CÓ HOÀN TIỀN HOẶC TÍN DỤNG CHO CÁC KỲ THANH TOÁN HÀNG THÁNG.\n\n\n\n10. CHỦ SỞ HỮU NỘI DUNG VÀ QUYỀN BẠN CẤP PHÉP\n\nChúng tôi không tuyên bố quyền sở hữu đối với bất kỳ công thức nấu ăn, hình ảnh, đồ họa, bình luận, thông tin, dữ liệu, văn bản hoặc tài liệu nào khác mà bạn tải lên hoặc đăng trên Trang web hoặc Ứng dụng của chúng tôi (\"Nội dung\").\n\n\n\nTuy nhiên, khi bạn tải Nội dung, bao gồm công thức nấu ăn, lên Trang web hoặc Ứng dụng của chúng tôi, bạn cấp cho chúng tôi quyền và giấy phép toàn cầu, miễn phí bản quyền, liên tục và có thể chuyển nhượng (mà chúng tôi cũng có thể cấp cho các chi nhánh và bên thứ ba, bao gồm những người dùng khác) để sử dụng, sao chép, tái tạo, xử lý, điều chỉnh, sửa đổi, dịch, xuất bản, truyền tải, hiển thị và phân phối (bao gồm thông qua bên thứ ba) Nội dung đó hoặc các sản phẩm phái sinh của nó, trong bất kỳ và tất cả các phương tiện hoặc phương pháp phân phối (hiện đã biết hoặc phát triển sau này) cho bất kỳ và tất cả các hoạt động kinh doanh của chúng tôi. Bạn cũng đồng ý rằng:\n\n\n\ngiấy phép này bao gồm quyền cho phép chúng tôi cung cấp, quảng bá và khai thác thương mại Nội dung được tải lên Trang web hoặc Ứng dụng của chúng tôi theo bất kỳ phương tiện, cách thức hoặc hình thức nào cho hoặc với những người dùng hoặc cá nhân khác hợp tác với chúng tôi để phân phối hoặc xuất bản Nội dung trên các phương tiện truyền thông và dịch vụ khác;\n\nnhững mục đích sử dụng bổ sung như vậy của chúng tôi, những người dùng khác của Trang web hoặc Ứng dụng của chúng tôi và những người khác hợp tác với chúng tôi để phân phối hoặc xuất bản Nội dung của bạn có thể được thực hiện mà không cần trả bất kỳ khoản bồi thường nào cho bạn đối với Nội dung mà bạn tải lên Trang web hoặc Ứng dụng của chúng tôi;\n\nbạn cho phép chúng tôi báo cáo hành vi vi phạm bản quyền thay mặt bạn cho đại lý được chỉ định, chủ sở hữu trang web, nhà cung cấp dịch vụ lưu trữ hoặc bất kỳ liên hệ phù hợp nào khác khi chúng tôi phát hiện Nội dung của bạn bị vi phạm; và\n\nbạn từ bỏ hoặc, nếu không thể, đồng ý không khẳng định tất cả các quyền đạo đức (và tất cả các quyền tương tự tại các khu vực pháp lý khác) mà bạn có hoặc sẽ có hiện tại hoặc trong tương lai liên quan đến Nội dung của bạn.\n\n11. QUYỀN SỞ HỮU TRÍ TUỆ\n\nNgoại trừ Nội dung của bạn, bao gồm công thức nấu ăn của bạn, mọi quyền sở hữu trí tuệ trong Dịch vụ Tastopia và mọi tài liệu trên Trang web hoặc Ứng dụng của chúng tôi, bao gồm thiết kế, đồ họa, văn bản, hình ảnh, phần mềm, các tệp khác cũng như lựa chọn và sắp xếp của chúng (gọi chung là “Tài liệu”) đều thuộc sở hữu của chúng tôi và/hoặc bên cấp phép của chúng tôi.\n\n\n\nChúng tôi cấp cho bạn quyền sử dụng Tài liệu trong phạm vi và chỉ trong phạm vi cần thiết để truy cập và sử dụng Dịch vụ Tastopia cho mục đích sử dụng cá nhân, phi thương mại của bạn theo các Điều khoản dịch vụ này. Mọi quyền khác được bảo lưu rõ ràng.\n\n\n\nVì thế:\n\n\n\nbạn không được sử dụng bất kỳ phần nào của Tài liệu, hoặc Trang web hoặc Ứng dụng của chúng tôi cho mục đích thương mại mà không có sự đồng ý rõ ràng từ chúng tôi và/hoặc (nếu có) bên cấp phép của chúng tôi;\n\nbạn không được sử dụng bất kỳ hình ảnh minh họa, ảnh chụp, chuỗi video hoặc âm thanh hoặc bất kỳ đồ họa nào tách biệt khỏi bất kỳ văn bản đi kèm nào; hoặc\n\nbạn không được sử dụng Tài liệu bên ngoài Trang web hoặc Ứng dụng của chúng tôi, đặc biệt là bằng cách xóa bất kỳ tư cách nào của những người đóng góp được xác định là tác giả của Tài liệu trên Trang web hoặc Ứng dụng của chúng tôi.\n\n12. QUY TẮC ỨNG XỬ\n\nBạn hứa rằng bạn sẽ không:\n\n\n\nvi phạm quyền sở hữu trí tuệ của bên thứ ba, bao gồm nhưng không giới hạn ở quyền sở hữu trí tuệ như bản quyền và nhãn hiệu của chúng tôi, người dùng khác hoặc bên thứ ba;\n\nxâm phạm quyền sở hữu, quyền riêng tư và quyền hình ảnh của chúng tôi, người dùng khác hoặc bên thứ ba;\n\ntiết lộ thông tin, chẳng hạn như tên, địa chỉ gửi thư, số điện thoại và địa chỉ email của một cá nhân cụ thể mà không được phép và qua đó bất kỳ bên thứ ba nào cũng có thể xác định được cá nhân đó;\n\nđăng ký nhiều địa chỉ email để có được nhiều tài khoản trong khi chỉ là một người dùng duy nhất;\n\nmở tài khoản thay mặt cho Người dùng đã đăng ký có tài khoản đã bị đình chỉ hoặc chấm dứt;\n\nphân biệt đối xử, quấy rối, bắt nạt, đe dọa, phỉ báng hoặc làm tổn hại đến danh tiếng và uy tín của người dùng khác hoặc bên thứ ba;\n\nthay đổi và/hoặc xóa Tài liệu được cung cấp thông qua Dịch vụ Tastopia;\n\nmạo danh chúng tôi, người dùng khác hoặc bên thứ ba (bao gồm cả việc làm giả tiêu đề email nhằm mục đích làm sai lệch nguồn gốc của tiêu đề email và danh tính của người gửi);\n\ntruyền các chương trình máy tính hoặc vi-rút có hại hoặc khiến người dùng khác hoặc bên thứ ba nhận được các chương trình hoặc vi-rút đó;\n\ntruy cập trái phép, hoặc thực hiện quét cổng, tấn công từ chối dịch vụ hoặc gửi thư rác vào các tiện ích của người dùng khác hoặc bên thứ ba hoặc các tiện ích được Dịch vụ Tastopia sử dụng (bao gồm nhưng không giới hạn ở các tiện ích viễn thông, máy tính và các thiết bị khác, cũng như phần mềm được chúng tôi sử dụng để cung cấp Dịch vụ Tastopia) và/hoặc gây ra hoặc cố gắng gây ra sự can thiệp vào việc sử dụng hoặc vận hành các tiện ích đó;\n\ntruyền, mà không được phép, email mang tính quảng cáo, khuyến mại hoặc chào hàng hoặc có tính chất gây khó chịu (bao gồm thư rác); cản trở việc nhận email của người dùng khác hoặc bên thứ ba; yêu cầu truyền email chuỗi và/hoặc truyền email chuỗi theo các yêu cầu đó;\n\nlưu hành thông tin, thiết bị và phần mềm được sử dụng nhằm mục đích vô hiệu hóa hoặc phá vỡ chức năng kiểm soát truy cập của máy chủ và các cơ sở khác;\n\nsao chép, sửa đổi, tháo rời, phân tích ngược hoặc phân tích các mẫu hoặc phần mềm có trong Tài liệu (trừ trường hợp được pháp luật cho phép và bạn đồng ý thông báo cho chúng tôi trong trường hợp đó);\n\nlấy thông tin tài khoản mà không được phép hoặc thông qua gian lận (bao gồm nhưng không giới hạn ở lừa đảo hoặc các phương pháp tương tự);\n\nsử dụng Dịch vụ Tastopia cho các hoạt động thương mại (bao gồm bất kỳ hoạt động nào được khuyến khích), vì lợi nhuận và dự đoán lợi nhuận, trừ khi đã có được sự chấp thuận trước bằng văn bản từ chúng tôi;\n\nsử dụng Dịch vụ Tastopia cho chiến dịch tranh cử hoặc các hoạt động chính trị khác;\n\nsử dụng Dịch vụ Tastopia vi phạm luật pháp và quy định hiện hành;\n\ncản trở hoạt động của Dịch vụ Tastopia hoặc cản trở việc trao đổi hoặc chia sẻ Nội dung do người dùng khác hoặc bên thứ ba đóng góp; hoặc gây thiệt hại hoặc mất mát cho chúng tôi, người dùng khác hoặc bên thứ ba bằng cách làm tổn hại đến uy tín của họ hoặc xâm phạm quyền sở hữu trí tuệ của họ;\n\ngây cản trở đáng kể đến hoạt động kinh doanh của chúng tôi thông qua các cuộc điều tra hoặc email lặp đi lặp lại, phù phiếm hoặc gây phiền nhiễu, vượt quá nghĩa vụ của chúng tôi và/hoặc không hợp lý;\n\nvi phạm Điều khoản dịch vụ; hoặc cản trở trật tự công cộng và đạo đức (bao gồm nhưng không giới hạn ở việc truyền hoặc hiển thị Nội dung có thể thúc đẩy và kích động bạo lực, hình ảnh bất hợp pháp hoặc tự tử);\n\nthiết lập liên kết đến Trang web hoặc Ứng dụng của chúng tôi để khuyến khích bất kỳ hành động nào, bao gồm cả hành động của bên thứ ba, được mô tả ở trên;\n\nvi phạm các yêu cầu khác mà chúng tôi có thể áp dụng theo thời gian theo quyết định riêng và tuyệt đối của mình; hoặc\n\nsử dụng Dịch vụ Tastopia theo cách mà Tastopia có lý do để cho là không phù hợp hoặc không thích hợp. Tastopia sẽ tham khảo các yếu tố như cách sử dụng Dịch vụ Tastopia thông thường của phần lớn người dùng và thông lệ chung của ngành khi xác định việc sử dụng đó là không phù hợp hoặc không thích hợp.\n\n13. QUÉT HÌNH ẢNH TỰ ĐỘNG\n\nVới tư cách là một tính năng tùy chọn, Tastopia có thể cung cấp tính năng phân loại hình ảnh tự động giúp bạn tải lên các hình ảnh liên quan đến thực phẩm. Nếu bạn chọn sử dụng tính năng tùy chọn này, các hình ảnh có sẵn trên thiết bị của bạn sẽ được gửi đến máy chủ của chúng tôi và được quét tự động bằng phần mềm nhận dạng hình ảnh tự động để cố gắng xác định hình ảnh nào của bạn liên quan đến thực phẩm. Các hình ảnh tạm thời được xác định là liên quan đến thực phẩm sẽ được hiển thị cho bạn trên trang riêng tư của bạn tại Ứng dụng của chúng tôi, nơi mà chỉ bạn mới có quyền truy cập. Bạn có thể xóa thủ công các hình ảnh không mong muốn được hiển thị trên trang riêng tư. Bất kỳ hình ảnh nào không được xác định là liên quan đến thực phẩm hoặc bạn đã xóa thủ công sẽ bị xóa khỏi máy chủ của Tastopia.\n\n\n\n14. TRÁCH NHIỆM VỀ NỘI DUNG\n\nBạn hoàn toàn chịu trách nhiệm về Nội dung mà bạn đăng, tải lên và/hoặc xuất bản bằng Dịch vụ Tastopia. Chúng tôi không xem xét hoặc sàng lọc bất kỳ Nội dung nào của bạn trước khi Nội dung đó xuất hiện hoặc được chia sẻ.\n\n\n\nBạn hứa rằng:\n\n\n\nbất kỳ Nội dung nào bạn đăng hoặc xuất bản đều tuân thủ các Điều khoản Dịch vụ này;\n\nbạn có quyền sử dụng, tải lên, đăng hoặc xuất bản Nội dung lên Ứng dụng hoặc Trang web của chúng tôi và cấp cho chúng tôi các giấy phép như đã nêu trong Mục 10; và\n\nviệc Tastopia sử dụng Nội dung bạn đã tải lên, đăng hoặc xuất bản sẽ không vi phạm quyền của bất kỳ bên thứ ba nào.\n\nBạn đồng ý và thừa nhận rằng:\n\n\n\nchúng tôi sẽ không chịu trách nhiệm hoặc chịu trách nhiệm pháp lý với bất kỳ bên thứ ba nào về Nội dung hoặc tính chính xác của bất kỳ Nội dung nào do bạn hoặc bất kỳ người dùng nào khác của Trang web hoặc Ứng dụng của chúng tôi đăng;\n\nchúng tôi có quyền xóa bất kỳ Nội dung nào bạn cung cấp trên Trang web hoặc Ứng dụng của chúng tôi theo quyết định riêng của chúng tôi, bao gồm; nếu theo ý kiến ​​của chúng tôi, Nội dung của bạn không tuân thủ các Điều khoản dịch vụ này hoặc nếu chúng tôi tin rằng điều đó là cần thiết để bảo vệ chúng tôi, những người dùng khác hoặc bất kỳ bên thứ ba nào; và\n\nbạn chịu toàn bộ trách nhiệm bảo mật và sao lưu Nội dung của mình.\n\n15. THAY ĐỔI CÁC ĐIỀU KHOẢN NÀY\n\nChúng tôi có thể sửa đổi các Điều khoản dịch vụ này (“Thay đổi”) bất kỳ lúc nào nếu:\n\n\n\ncó sự thay đổi trong luật pháp và quy định hiện hành;\n\ncó những thay đổi về thông số kỹ thuật hoặc hoạt động của Dịch vụ Tastopia;\n\ncó những thay đổi về chính sách nhóm Tastopia hoặc các quy định nội bộ;\n\ncó những thay đổi về thông số kỹ thuật dịch vụ hoặc chính sách của các dịch vụ bên thứ ba bên ngoài được Tastopia sử dụng hoặc kết nối với Dịch vụ Tastopia;\n\ncó những thay đổi trong môi trường kinh doanh mà Tastopia đang hoạt động;\n\ncần thiết để ứng phó với các mối đe dọa thực tế hoặc tiềm ẩn đối với doanh nghiệp của chúng tôi (chẳng hạn như các mối đe dọa về an ninh mạng) hoặc các hành vi hoặc hoạt động không mong muốn hoặc nguy hiểm trong cộng đồng của chúng tôi;\n\ncần phải làm rõ hoặc sửa đổi bất kỳ phần nào của Điều khoản dịch vụ này; hoặc\n\ncác tình huống khác, không lường trước được, có thể yêu cầu chúng tôi phải sửa đổi các Điều khoản Dịch vụ này một cách hợp lý;\n\nVui lòng kiểm tra trang này theo thời gian để lưu ý bất kỳ Thay đổi nào mà chúng tôi thực hiện, vì chúng ràng buộc bạn, trừ khi bạn chấm dứt tài khoản của mình. Chúng tôi sẽ thông báo cho bạn về các Thay đổi quan trọng, bao gồm bằng cách đăng khi bạn truy cập Trang web hoặc Ứng dụng của chúng tôi hoặc qua email đến địa chỉ email đã đăng ký khi bạn đăng ký tài khoản.\n\n\n\nNếu bạn tiếp tục sử dụng Dịch vụ Tastopia sau khi có Thay đổi, bạn đồng ý với các Thay đổi đó. Nếu bạn không chấp nhận Thay đổi: (i) nếu bạn là Khách hoặc Người dùng đã đăng ký, vui lòng ngừng sử dụng Dịch vụ Tastopia hoặc (ii) nếu bạn là người dùng Dịch vụ cao cấp, bạn phải chấm dứt đăng ký trong vòng ba mươi (30) ngày sau khi chúng tôi thông báo cho bạn về Thay đổi (hoặc bạn biết về Thay đổi, nếu sớm hơn).\n\n\n\nNếu bạn ngừng sử dụng Dịch vụ Tastopia hoặc chấm dứt Dịch vụ Cao cấp (nếu có) theo đoạn trước, các Thay đổi có liên quan sẽ không ràng buộc bạn. Xin lưu ý rằng, ngay cả khi các Thay đổi không ràng buộc bạn, nếu bạn không chấm dứt đăng ký của mình trước ngày gia hạn tiếp theo, bạn sẽ bị tính phí đăng ký cho dịch vụ của tháng tiếp theo.\n\n\n\nCác Điều khoản dịch vụ này được cập nhật lần cuối vào ngày 1 tháng 11. Chúng tôi đã cập nhật Điều khoản dịch vụ thành:\n\n\n\nsửa đổi đơn vị ký kết hợp đồng từ Tastopia Limited thành chi nhánh đã đăng ký tại Vương quốc Anh của Tastopia, Inc.; và\n\nđưa ra một số luật chung về người tiêu dùng và cập nhật cách diễn đạt rõ ràng hơn (bao gồm sửa đổi Mục 19 và 23, và Mục 24 mới).\n\n16. THAY ĐỔI TRANG WEB HOẶC ỨNG DỤNG VÀ DỊCH VỤ tastopia CỦA CHÚNG TÔI\n\nChúng tôi có thể cập nhật Trang web hoặc Ứng dụng của mình theo thời gian và có thể thay đổi Tài liệu bất kỳ lúc nào. Chúng tôi cũng có quyền thay đổi và cải thiện các tính năng và chức năng của Dịch vụ Tastopia bất kỳ lúc nào và theo quyết định riêng của chúng tôi. Điều này bao gồm việc thêm, sửa đổi hoặc xóa các tính năng và chức năng cụ thể của Dịch vụ Tastopia. Nếu chúng tôi có ý định xóa bất kỳ chức năng quan trọng nào của Dịch vụ Cao cấp mà bạn đăng ký, chúng tôi sẽ thông báo trước cho bạn một cách hợp lý. Xin lưu ý rằng bất kỳ Tài liệu nào trên Trang web hoặc Ứng dụng của chúng tôi có thể lỗi thời tại bất kỳ thời điểm nào và chúng tôi không có nghĩa vụ phải cập nhật.\n\n\n\n17. TẠM DỪNG HOẶC VĨNH VIỄN DỊCH VỤ tastopia\n\nChúng tôi không đảm bảo rằng Dịch vụ Tastopia hoặc bất kỳ Tài liệu nào trên Trang web và Ứng dụng sẽ luôn khả dụng hoặc không bị gián đoạn. Chúng tôi có thể tạm ngừng, thu hồi hoặc ngừng toàn bộ hoặc bất kỳ phần nào của Dịch vụ Tastopia mà không cần thông báo. Chúng tôi sẽ không chịu trách nhiệm với bạn nếu vì bất kỳ lý do nào, Dịch vụ Tastopia của chúng tôi không khả dụng tại bất kỳ thời điểm nào hoặc trong bất kỳ khoảng thời gian nào.\n\n\n\nChúng tôi cũng có thể tạm ngừng hoặc hủy quyền truy cập hoặc quyền sử dụng Dịch vụ Tastopia của bạn khi chúng tôi thu hồi chúng. Trong trường hợp đó, chúng tôi sẽ thông báo cho bạn trước một thời gian hợp lý.\n\n\n\n18. HẠN CHẾ, TẠM DỪNG HOẶC HỦY BỎ VIỆC SỬ DỤNG\n\nChúng tôi có thể hạn chế, đình chỉ, thu hồi hoặc chấm dứt quyền truy cập hoặc quyền sử dụng Dịch vụ Tastopia của bạn mà không cần thông báo trước trong các trường hợp sau. Khi có thể, chúng tôi sẽ thông báo cho bạn về ý định thực hiện việc này tuy nhiên:\n\n\n\nbạn đã vi phạm các Điều khoản dịch vụ này;\n\nbạn đã cung cấp cho chúng tôi thông tin sai lệch;\n\nbạn đang sử dụng Dịch vụ Tastopia một cách bất hợp pháp hoặc vi phạm quyền của bên thứ ba;\n\nbạn chưa thanh toán Phí đăng ký cho Dịch vụ cao cấp, chúng tôi đã nhắc nhở bạn về điều này và bạn vẫn chưa thanh toán;\n\nđiều này là cần thiết để bảo vệ bản thân chúng tôi, người dùng khác hoặc bất kỳ bên thứ ba nào;\n\ncó khả năng các bên thứ ba sẽ đưa ra khiếu nại hoặc tố tụng chống lại chúng tôi do những tình huống liên quan đến việc bạn sử dụng Dịch vụ Tastopia;\n\nkhông thể liên lạc với bạn qua điện thoại, fax và/hoặc email;\n\nđó là trường hợp khẩn cấp; và/hoặc\n\nđiều này là cần thiết để vận hành Dịch vụ Tastopia.\n\nViệc hạn chế, đình chỉ, thu hồi hoặc ngừng cung cấp Dịch vụ Tastopia có thể dẫn đến mất quyền truy cập và sử dụng vĩnh viễn một số khía cạnh nhất định của dịch vụ, bao gồm cả Nội dung do bạn tải lên, ngay cả khi sau này bạn đăng ký lại hoặc đăng ký lại Dịch vụ Tastopia.\n\n\n\n19. GIỚI HẠN TRÁCH NHIỆM CỦA CHÚNG TÔI\n\nKhông có điều khoản nào trong Điều khoản dịch vụ này loại trừ hoặc hạn chế trách nhiệm của chúng tôi đối với trường hợp tử vong hoặc thương tích cá nhân phát sinh do hành vi bất cẩn, gian lận hoặc trình bày sai sự thật mang tính gian dối của chúng tôi.\n\n\n\nChúng tôi sẽ không chịu trách nhiệm với bạn về bất kỳ tổn thất hoặc thiệt hại nào mà bạn phải chịu: (i) không thể lường trước một cách hợp lý tại thời điểm bạn chấp nhận các Điều khoản dịch vụ này - tổn thất hoặc thiệt hại là có thể lường trước một cách hợp lý nếu tại thời điểm bạn chấp nhận các Điều khoản dịch vụ này, điều đó là hiển nhiên rằng nó có thể xảy ra hoặc cả bạn và chúng tôi đều biết rằng nó có thể xảy ra, ví dụ, nếu bạn và chúng tôi đã thảo luận về điều đó; hoặc (ii) không phải do chúng tôi vi phạm một điều khoản nào đó của các Điều khoản dịch vụ này hoặc bất kỳ lỗi nào khác của chúng tôi.\n\n\n\nChúng tôi cũng sẽ không chịu trách nhiệm với bạn về:\n\n\n\nbất kỳ lỗi hoặc thiếu sót nào trong bất kỳ công thức hoặc Tài liệu nào khác;\n\nviệc sử dụng hoặc dựa vào bất kỳ Tài liệu nào được hiển thị trên Trang web hoặc Ứng dụng của chúng tôi;\n\nbất kỳ truy cập hoặc sử dụng trái phép nào vào máy chủ an toàn của chúng tôi hoặc bất kỳ và tất cả thông tin cá nhân không được bảo mật;\n\nbất kỳ sự gián đoạn hoặc chấm dứt việc truyền tải đến hoặc đi từ Trang web hoặc Ứng dụng của chúng tôi;\n\nvi-rút, tấn công từ chối dịch vụ phân tán hoặc các tài liệu gây hại về mặt công nghệ khác có thể lây nhiễm vào thiết bị máy tính, chương trình máy tính, dữ liệu hoặc tài liệu độc quyền khác của bạn do bạn sử dụng Trang web hoặc Ứng dụng của chúng tôi hoặc do bạn tải xuống bất kỳ Tài liệu nào trên đó hoặc trên bất kỳ trang web nào được liên kết với nó;\n\nnội dung của các trang web được liên kết trên Trang web hoặc Ứng dụng của chúng tôi; hoặc\n\nyêu cầu, khẳng định, khiếu nại, vụ kiện, hành động hoặc thủ tục tố tụng khác của bên thứ ba được người dùng khác đưa ra chống lại bạn, cáo buộc rằng Nội dung của bạn vi phạm bất kỳ quyền sở hữu trí tuệ nào của bên thứ ba hoặc chiếm dụng thông tin bí mật của bên thứ ba;\n\nTrách nhiệm hữu hạn đối với Người dùng đã đăng ký Dịch vụ cao cấp Chúng tôi sẽ chỉ chịu trách nhiệm với Người dùng đã đăng ký Dịch vụ cao cấp lên đến tổng giới hạn tối đa của Phí đăng ký mà Người dùng đã đăng ký đó đã thanh toán cho chúng tôi liên quan đến Dịch vụ cao cấp.\n\n\n\n20. KẾT NỐI INTERNET\n\nĐể sử dụng Trang web và Ứng dụng của chúng tôi, thiết bị của bạn sẽ cần kết nối internet. Bạn chịu hoàn toàn trách nhiệm về việc tự chi trả cho bất kỳ phần cứng, phần mềm và dịch vụ của bên thứ ba nào (chẳng hạn như gói dịch vụ không dây được mua thông qua nhà cung cấp dịch vụ viễn thông) cần thiết để kết nối thiết bị của bạn với internet, bao gồm bất kỳ khoản phí truyền dữ liệu nào có thể được áp dụng bởi nhà cung cấp dịch vụ bạn chọn và nếu bạn chọn tải lên lượng dữ liệu lớn như tệp hình ảnh, thì có thể là đáng kể.\n\n\n\n21. LIÊN KẾT VÀ TÀI NGUYÊN CỦA BÊN THỨ BA TRÊN TRANG WEB HOẶC ỨNG DỤNG CỦA CHÚNG TÔI\n\nKhi Trang web hoặc Ứng dụng của chúng tôi chứa các liên kết đến các trang web và tài nguyên khác do bên thứ ba cung cấp, các liên kết này chỉ được cung cấp để bạn tham khảo. Chúng tôi không kiểm soát nội dung của các trang web hoặc tài nguyên đó.\n\n\n\n22. QUYỀN CỦA BÊN THỨ BA\n\nCác bên có ý định rằng không có cá nhân nào không phải là bên tham gia vào các điều khoản này sẽ có bất kỳ quyền nào theo Đạo luật Hợp đồng (Quyền của Bên thứ ba) năm 1999 hoặc theo cách khác để thực thi bất kỳ điều khoản nào của Điều khoản Dịch vụ này. Không cần sự đồng ý của bất kỳ bên thứ ba nào để thay đổi các điều khoản này.\n\n\n\n23. LUẬT ÁP DỤNG VÀ QUYỀN HẠN\n\nChúng tôi sẽ cố gắng hết sức để giải quyết mọi tranh chấp liên quan đến Điều khoản dịch vụ này.\n\n\n\nCác Điều khoản dịch vụ này, nội dung và hình thức của chúng, được điều chỉnh bởi luật pháp Anh. Tuy nhiên, nếu bạn là người tiêu dùng và cư trú tại bất kỳ quốc gia nào khác thuộc Liên minh châu Âu, bạn sẽ được hưởng lợi từ, và nếu bạn là người tiêu dùng và cư trú tại bất kỳ quốc gia nào khác không thuộc Liên minh châu Âu, bạn có thể được hưởng lợi từ, các điều khoản bắt buộc và các quyền hợp pháp có sẵn cho bạn theo luật pháp của quốc gia đó. Không có điều khoản nào trong các Điều khoản dịch vụ này ảnh hưởng đến quyền của bạn với tư cách là người tiêu dùng để dựa vào các điều khoản bắt buộc và quyền hợp pháp của luật pháp địa phương này.\n\n\n\nBạn và chúng tôi đều đồng ý rằng tòa án Anh và xứ Wales sẽ có thẩm quyền không độc quyền. Tuy nhiên, nếu bạn là người tiêu dùng và cư trú tại bất kỳ quốc gia nào khác, bạn và chúng tôi cũng có thể tiến hành tố tụng tại quốc gia đó.\n\n\n\n24. ODR\n\nỦy ban EU đã cung cấp một nền tảng internet để giải quyết tranh chấp trực tuyến (“Nền tảng ODR”). Nền tảng ODR này đóng vai trò là điểm cho giải quyết tranh chấp thay thế liên quan đến các nghĩa vụ hợp đồng từ các hợp đồng trực tuyến. Nền tảng ODR có thể truy cập tại liên kết sau: http://ec.europa.eu/consumers/odr.\n\n\n\n25. THƯƠNG HIỆU\n\n“tastopia” và logo tastopia là nhãn hiệu đã đăng ký của Tastopia Inc. tại Nhật Bản, Vương quốc Anh và một số khu vực pháp lý khác.\n\n\n\n26. LIÊN HỆ VỚI CHÚNG TÔI\n\nĐể liên hệ với chúng tôi, vui lòng gửi email đến info-vn@tastopia.com\n\n\n\nNếu bạn đang cư trú tại một quốc gia thuộc Liên minh Châu Âu:\n\nNếu bạn đã bắt đầu Dịch vụ cao cấp, bạn có quyền thay đổi quyết định và được hoàn lại toàn bộ tiền trong vòng mười bốn (14) ngày kể từ lần đăng ký đầu tiên, bằng cách gửi email cho chúng tôi theo địa chỉ info-vn@tastopia.com với nội dung sau:\n\n\n\nTôi xin thông báo rằng tôi sẽ hủy hợp đồng đăng ký Dịch vụ cao cấp đã đặt vào ngày [ ](ngày)\n\nTên người tiêu dùng:\n\nTên người dùng:\n\nĐịa chỉ của người tiêu dùng:\n\nNgày:\n\n\n\nNếu bạn đang cư trú tại Tây Ban Nha:\n\nBạn cũng có thể liên hệ với chúng tôi qua số điện thoại: 965225615\n\nGiấy phép về Nội dung được tải lên mà bạn cấp cho chúng tôi theo Mục 10 sẽ có hiệu lực trong thời hạn hiệu lực của các quyền theo bất kỳ luật hiện hành nào.\n\nĐoạn (iv) trong Mục 10 không áp dụng và được coi là đã bị xóa.\n\nBạn có thể in và tải xuống các Điều khoản dịch vụ này để hỗ trợ vĩnh viễn bất cứ lúc nào.\n\nNếu bạn đang cư trú tại Hoa Kỳ:\n\nTastopia tuân thủ Đạo luật Bản quyền Thiên niên kỷ Kỹ thuật số (17 USC §512). Nếu bạn tin rằng bất kỳ tài liệu nào trên Trang web của chúng tôi vi phạm bản quyền của bạn, vui lòng thông báo cho đại lý được chỉ định của chúng tôi theo địa chỉ sau: tastopia-legal@tastopia.com.\n\n\n\nThông báo của bạn cho đại lý của chúng tôi phải bao gồm mô tả về tác phẩm mà bạn cho rằng đã bị vi phạm; vị trí trên Trang web của chúng tôi nơi chúng tôi có thể tìm thấy tài liệu vi phạm; thông tin liên lạc của bạn bao gồm tên, địa chỉ, số điện thoại và địa chỉ email; và tuyên bố của bạn, được ký dưới hình phạt về tội khai man, rằng bạn là chủ sở hữu bản quyền và bạn cho rằng việc sử dụng tài liệu được báo cáo là trái phép.\n\n\n\nNếu bạn đang cư trú tại Ấn Độ:\n\nBạn cũng có thể liên hệ với chúng tôi qua email tại info-in@tastopia.com.\n\n\n\nT&C này là một hồ sơ điện tử theo Đạo luật Công nghệ thông tin năm 2000 (đã sửa đổi/ban hành lại) và các quy định theo đó, và được công bố theo các điều khoản của Quy tắc 3 (1) của Quy tắc Công nghệ thông tin (Hướng dẫn dành cho người trung gian và Bộ luật đạo đức truyền thông kỹ thuật số), năm 2021, trong đó yêu cầu công bố các quy tắc và quy định, chính sách bảo mật và điều khoản sử dụng để truy cập hoặc sử dụng Ứng dụng. Hồ sơ điện tử này được tạo bởi hệ thống máy tính và không yêu cầu bất kỳ chữ ký vật lý hoặc chữ ký số nào.\n\n\n\nVề các Điều khoản dịch vụ này\n\nNếu bất kỳ điều khoản nào hoặc một phần điều khoản nào của Điều khoản dịch vụ này bị tòa án hoặc cơ quan quản lý tuyên bố là không thể thi hành, thì các điều khoản khác vẫn tiếp tục được áp dụng.\n\n\n\nNếu bạn hoặc chúng tôi vi phạm các Điều khoản dịch vụ này và bạn hoặc chúng tôi không có hành động nào chống lại bên kia, bạn hoặc chúng tôi vẫn có quyền sử dụng các quyền và biện pháp khắc phục của mình trong bất kỳ tình huống nào khác mà bạn hoặc chúng tôi vi phạm các Điều khoản dịch vụ này.\n\n\n\nCảm ơn bạn đã sử dụng Dịch vụ Tastopia.\n"
  }
}
