{
  "section1": {
    "title": "Có hiệu lực từ ngày 1 tháng 1 năm 2025",
    "content1": "VUI LÒNG ĐỌC KỸ CÁC ĐIỀU KHOẢN VÀ ĐIỀU KIỆN NÀY TRƯỚC KHI SỬ DỤNG TRANG WEB HOẶC ỨNG DỤNG NÀY",
    "content2": "Các điều khoản dịch vụ này (“Điều khoản dịch vụ”) (cùng với các tài liệu mà chúng tham chiếu đến) cho bạn biết các điều khoản bạn có thể sử dụng trang web (“Trang web”) hoặc ứng dụng di động (“Ứng dụng”) của Tastopia. Việc sử dụng Trang web hoặc Ứng dụng bao gồm truy cập, duyệt hoặc đăng ký sử dụng Trang web hoặc Ứng dụng.",
    "content3": "Trang web và Ứng dụng này được điều hành bởi chi nhánh đăng ký tại Việt Nam của Tastopia Inc., một công ty đăng ký tại Cần Thơ, Việt Nam (“chúng tôi”, “của chúng tôi” hoặc “Tastopia”) và các chi nhánh của nó (là các thực thể kiểm soát, được kiểm soát bởi hoặc dưới sự kiểm soát chung với Tastopia).",
    "content4": "Bằng cách sử dụng Trang web hoặc Ứng dụng của chúng tôi, bạn xác nhận rằng bạn chấp nhận và đồng ý tuân thủ các Điều khoản dịch vụ được nêu dưới đây. Nếu bạn không đồng ý với các Điều khoản dịch vụ này, bạn không được sử dụng Trang web hoặc Ứng dụng của chúng tôi. Chúng tôi khuyên bạn nên giữ một bản sao của các Điều khoản dịch vụ này để tham khảo trong tương lai."
  },
  "section2": {
    "title": "CÁC CHÍNH SÁCH BỔ SUNG",
    "content1": "Các chính sách bổ sung sau đây cũng áp dụng cho việc bạn sử dụng Trang web hoặc Ứng dụng của chúng tôi:",
    "list1": "• Chính sách bảo mật của chúng tôi, giải thích những thông tin cá nhân chúng tôi thu thập, lý do chúng tôi thu thập, cách chúng tôi sử dụng, các quyền kiểm soát bạn có đối với thông tin cá nhân của bạn và các quy trình chúng tôi áp dụng để bảo vệ quyền riêng tư của bạn. Chính sách này áp dụng cho thông tin cá nhân chúng tôi thu thập thông qua Trang web và Ứng dụng. Vui lòng đảm bảo bạn đọc kỹ Chính sách bảo mật của chúng tôi trước khi sử dụng Trang web hoặc Ứng dụng.\n\n• Nguyên tắc cộng đồng của chúng tôi, quy định các mục đích sử dụng được phép và bị cấm trên Trang web hoặc Ứng dụng của chúng tôi. Các Nguyên tắc cộng đồng này là một phần của Điều khoản dịch vụ này, vì vậy các tham chiếu đến Điều khoản dịch vụ bao gồm cả các nguyên tắc này."
  },
  "section3": {
    "title": "THÔNG TIN VỀ CHÚNG TÔI",
    "content1": "Chúng tôi là chi nhánh đăng ký tại Việt Nam của Tastopia Inc., một công ty đăng ký tại Cần Thơ, Việt Nam. Chi nhánh có văn phòng tại Ninh Kiều, Cần Thơ, Việt Nam.",
    "content2": "Nếu bạn có bất kỳ câu hỏi hoặc khiếu nại nào về Trang web hoặc Ứng dụng của chúng tôi, hoặc bất kỳ khía cạnh nào liên quan đến Tastopia, vui lòng liên hệ với chúng tôi tại: tastopiaapp@gmail.com"
  },
  "section4": {
    "title": "THÔNG TIN VỀ TRANG WEB VÀ ỨNG DỤNG CỦA CHÚNG TÔI",
    "content1": "Trang web và Ứng dụng của chúng tôi cung cấp cho bạn khả năng chia sẻ công thức nấu ăn với những người dùng khác của Trang web và Ứng dụng của chúng tôi, và duyệt các công thức nấu ăn của người dùng khác (“Dịch vụ Tastopia”). Ngoại trừ Dịch vụ cao cấp tùy chọn mà chúng tôi có thể cung cấp (xem Mục 7), Dịch vụ Tastopia được cung cấp miễn phí.",
    "content2": "Trang web của chúng tôi được thiết kế để hoạt động trên các trình duyệt web hiện đại, các hệ điều hành và nền tảng chính. Các tính năng và khả năng tương thích có thể khác nhau giữa một số trình duyệt web, hệ điều hành và nền tảng",
    "content3": "Chúng tôi có thể sử dụng các nhà cung cấp dịch vụ bên thứ ba trong việc cung cấp Dịch vụ Tastopia hoặc trong việc thực hiện các nghĩa vụ của chúng tôi theo các Điều khoản dịch vụ này.",
    "content4": "Chúng tôi không cam kết rằng Trang web hoặc Ứng dụng của chúng tôi, bất kỳ nội dung nào trên đó, hoặc các dịch vụ có thể được cung cấp bởi các nhà cung cấp dịch vụ bên thứ ba đó, sẽ không có lỗi hoặc thiếu sót."
  },
  "section5": {
    "title": "THÔNG TIN QUAN TRỌNG VỀ CÔNG THỨC NẤU ĂN",
    "content1": "Tất cả các công thức nấu ăn trên Trang web hoặc Ứng dụng của chúng tôi chỉ được cung cấp cho mục đích thông tin chung và được xuất bản bởi những người dùng khác, giống như bạn, chứ không phải bởi Tastopia. Tastopia không sàng lọc hoặc kiểm tra các công thức nấu ăn trước khi chúng được đăng, vì vậy có thể có một số công thức nấu ăn, nguyên liệu hoặc phương pháp nấu ăn không phù hợp, không chính xác hoặc không an toàn. Các công thức nấu ăn, bình luận và thông tin khác được cung cấp trên Trang web hoặc Ứng dụng của chúng tôi không nhằm mục đích đưa ra lời khuyên mà bạn nên dựa vào, và bất kỳ việc sử dụng hoặc dựa vào bất kỳ công thức nấu ăn hoặc nội dung nào khác được cung cấp trên Trang web hoặc Ứng dụng của chúng tôi đều do bạn tự chịu rủi ro.",
    "content2": "Tastopia không đưa ra bất kỳ tuyên bố nào, dù rõ ràng hay ngụ ý, về tính chính xác, chất lượng, an toàn hoặc phù hợp với mục đích của các công thức nấu ăn được xuất bản trên Dịch vụ Tastopia.",
    "content3": "Do đó:",
    "list1": "• bạn nên kiểm tra bất kỳ nguyên liệu hoặc phương pháp bất thường hoặc mới trong một công thức nấu ăn bằng cách tham khảo các nguồn khác;\n\n• bạn phải tuân thủ mọi lúc các thông báo hoặc bản tin về an toàn thực phẩm do cơ quan chính phủ địa phương của bạn ban hành, và bạn không nên mong đợi Dịch vụ Tastopia ghi chú hoặc giải thích các rủi ro liên quan đến việc chế biến thực phẩm, phương pháp hoặc kỹ thuật nấu ăn hoặc tiêu thụ một số loại thực phẩm nhất định; và\n\n• nếu bạn không phải là một người nấu ăn có kinh nghiệm, chúng tôi khuyên bạn nên nhận sự hướng dẫn từ một người nấu ăn có kinh nghiệm, hoặc cơ quan có thẩm quyền thích hợp khác, khi sử dụng các công thức nấu ăn từ Dịch vụ Tastopia, đặc biệt là về sức khỏe và an toàn.",
    "content4": "Nếu bạn có bất kỳ bình luận hoặc mối quan ngại nào về bất kỳ công thức nấu ăn hoặc nội dung nào khác trên Dịch vụ Tastopia hoặc, nếu bạn tin rằng tác phẩm có bản quyền của bạn đã bị vi phạm hoặc biết về tài liệu khác vi phạm, bất hợp pháp hoặc không phù hợp, vui lòng liên hệ với chúng tôi tại: tastopiaapp@gmail.com"
  },
  "section6": {
    "title": "ĐĂNG KÝ NGƯỜI DÙNG",
    "content1": "Đối với Trang web của chúng tôi, bạn có thể truy cập và xem các công thức nấu ăn mà không cần đăng ký với tư cách khách truy cập (“Khách”). Tuy nhiên, bạn sẽ có quyền truy cập vào nhiều tính năng hơn của Dịch vụ Tastopia nếu bạn tạo tài khoản thông qua đăng ký. Nếu bạn muốn đăng ký tài khoản để sử dụng Dịch vụ Tastopia, bạn sẽ phải hoàn thành thông tin tài khoản bắt buộc theo yêu cầu của chúng tôi bằng cách nộp đơn đăng ký theo định dạng do chúng tôi quy định, hoặc đăng ký bằng tài khoản bên thứ ba (ví dụ: Google).",
    "content2": "Chúng tôi sẽ tiến hành kiểm tra cần thiết đối với việc đăng ký của bạn trước hoặc sau quá trình đăng ký và, sau khi chúng tôi chấp nhận, bạn sẽ được đăng ký làm người dùng đã đăng ký (“Người dùng đã đăng ký”).",
    "content3": "Chúng tôi có quyền tạm ngừng, thu hồi hoặc ngừng cung cấp tài khoản, chi tiết tài khoản hoặc mật khẩu của bạn trong các trường hợp sau. Khi có thể, chúng tôi sẽ thông báo cho bạn về ý định thực hiện việc này và cho bạn cơ hội kháng cáo:",
    "list1": "• bạn không tồn tại;\n\n• bạn không có địa chỉ email có thể nhận email;\n\n• bạn vi phạm các Điều khoản dịch vụ này;\n\n• bạn đã hoặc dường như đã cố ý cung cấp thông tin sai cho chúng tôi;\n\n• bạn là trẻ vị thành niên và chưa gửi thông tin tài khoản với sự đồng ý của cha mẹ hoặc người giám hộ;\n\n• để ứng phó với các mối đe dọa thực tế hoặc tiềm ẩn đối với hoạt động kinh doanh của chúng tôi (chẳng hạn như các mối đe dọa an ninh mạng), hoặc các hành vi hoặc hành vi không mong muốn hoặc nguy hiểm trong cộng đồng của chúng tôi; hoặc\n\n• vì bất kỳ lý do nào được nêu trong Mục 18 dưới đây."
  },
  "section7": {
    "title": "TÀI KHOẢN VÀ MẬT KHẨU CỦA BẠN",
    "content1": "Nếu bạn chọn trở thành Người dùng đã đăng ký, bạn phải xử lý thông tin tài khoản của mình một cách bảo mật. Bạn không được tiết lộ thông tin đó cho bất kỳ bên thứ ba nào. Bạn chấp nhận hoàn toàn trách nhiệm và nghĩa vụ đối với tất cả các hoạt động xảy ra dưới tài khoản của bạn, trừ khi đó là lỗi của chúng tôi.",
    "content2": "Nếu bạn biết hoặc nghi ngờ rằng bất kỳ ai khác ngoài bạn biết tài khoản của bạn, bạn phải thông báo kịp thời cho chúng tôi tại tastopiaapp@gmail.com"
  },
  "section8": {
    "title": "DỊCH VỤ CAO CẤP",
    "content1": "Tính khả dụng. Chúng tôi có thể cung cấp dịch vụ dựa trên phí đăng ký tùy chọn (“Dịch vụ cao cấp”) được nhắm mục tiêu đến một số quốc gia nhất định. Nếu Dịch vụ cao cấp khả dụng trong khu vực của bạn, nó có thể khả dụng trên Trang web của chúng tôi (“Dịch vụ web cao cấp”) và/hoặc Ứng dụng (“Dịch vụ ứng dụng cao cấp”) hoặc cả hai.",
    "content2": "Sử dụng. Bất kể bạn đăng ký Dịch vụ cao cấp qua Trang web hay Ứng dụng của chúng tôi, việc sử dụng Dịch vụ cao cấp và các tính năng của nó đều khả dụng cho bạn trên cả Dịch vụ web cao cấp và Dịch vụ ứng dụng cao cấp nơi có sẵn ở quốc gia hoặc khu vực của bạn. Tuy nhiên, các tính năng và chức năng khả dụng có thể khác nhau tùy thuộc vào việc bạn đang sử dụng Dịch vụ web cao cấp hay Dịch vụ ứng dụng cao cấp."
  },
  "section9": {
    "title": "PHÍ DỊCH VỤ CAO CẤP",
    "content1": "Phí đăng ký. Nếu Dịch vụ cao cấp khả dụng cho bạn, phí cho Dịch vụ cao cấp sẽ được nêu trên Trang web của chúng tôi hoặc trong Ứng dụng của chúng tôi (“Phí đăng ký”). Phí đăng ký có thể khác nhau tùy theo quốc gia mà Dịch vụ cao cấp được nhắm mục tiêu, và liệu bạn có đăng ký Dịch vụ cao cấp qua Trang web hay Ứng dụng của chúng tôi hay không. Nếu đăng ký thông qua Ứng dụng của chúng tôi, Phí đăng ký cũng có thể khác nhau tùy thuộc vào việc bạn sử dụng nền tảng iOS hay Android. Phí đăng ký cho Dịch vụ cao cấp được thanh toán như sau:",
    "content2": "Dịch vụ cao cấp đăng ký qua Trang web của chúng tôi: Phí đăng ký. Nếu bạn đăng ký Dịch vụ cao cấp qua Trang web của chúng tôi, Phí đăng ký được thanh toán trả trước cho một thời gian cố định. Sau khi thời gian cố định kết thúc, đăng ký của bạn sẽ chấm dứt trừ khi bạn tham gia vào một đăng ký thời gian cố định tiếp theo.",
    "content3": "Dịch vụ cao cấp đăng ký qua Ứng dụng của chúng tôi: Phí đăng ký. Nếu bạn đăng ký Dịch vụ cao cấp từ Ứng dụng của chúng tôi, Phí đăng ký được thanh toán hàng tháng và đăng ký của bạn sẽ tự động gia hạn vào cuối mỗi tháng và Phí đăng ký áp dụng sẽ đến hạn trừ khi đăng ký của bạn bị hủy theo Mục 9.",
    "content4": "Thanh toán. Vào thời điểm đăng ký Dịch vụ cao cấp, bạn sẽ được yêu cầu thanh toán Phí đăng ký bằng phương thức thanh toán theo chỉ định của chúng tôi hoặc bộ xử lý thanh toán của chúng tôi theo thời gian. Phương thức thanh toán có thể khác nhau tùy thuộc vào vị trí của bạn và liệu bạn có đăng ký Dịch vụ cao cấp qua Trang web hay Ứng dụng của chúng tôi hay không.",
    "content5": "Thanh toán cho Dịch vụ cao cấp đăng ký qua Ứng dụng của chúng tôi. Bạn có thể đăng ký Dịch vụ cao cấp từ Ứng dụng của chúng tôi (Android / iOS). Bằng cách cung cấp cho bộ xử lý thanh toán được Google Inc. hoặc Apple Inc. ủy quyền (“Bộ xử lý thanh toán được ủy quyền”) thông tin chi tiết về phương thức thanh toán, bạn (i) cam kết rằng bạn được ủy quyền sử dụng phương thức thanh toán mà bạn đã cung cấp; (ii) cam kết rằng bất kỳ thông tin thanh toán nào bạn cung cấp đều đúng và chính xác; và (iii) ủy quyền cho Bộ xử lý thanh toán được ủy quyền thu Phí đăng ký hàng tháng định kỳ cho đến khi bạn hủy đăng ký Dịch vụ cao cấp của mình như mô tả trong Mục 9, hoặc bị chúng tôi chấm dứt theo các Điều khoản dịch vụ này. Bạn phải cập nhật thông tin chi tiết về phương thức thanh toán đã chọn của mình và đảm bảo có đủ tiền để trang trải chi phí Phí đăng ký. Để thay đổi thông tin thanh toán của bạn, vui lòng tham khảo các trang sau: Android / iOS. Nếu bạn gửi thông tin cập nhật về phương thức thanh toán của mình, bạn đồng ý cho phép Bộ xử lý thanh toán được ủy quyền sử dụng thông tin cập nhật để thu tiền từ bạn. Các thay đổi được thực hiện đối với thông tin thanh toán của bạn sẽ không áp dụng cho Phí đăng ký đã được gửi để thanh toán.",
    "content6": "Phí bên thứ ba. Chúng tôi hoặc bộ xử lý thanh toán của chúng tôi không chịu trách nhiệm về bất kỳ khoản phí hoặc lệ phí nào do ngân hàng, tổ chức phát hành thẻ tín dụng hoặc thẻ ghi nợ của bạn, hoặc nhà cung cấp tài khoản khác áp dụng khi thanh toán Phí đăng ký hoặc bất kỳ chi phí nào có thể phát sinh do các lần cố gắng thanh toán không thành công. Chúng tôi hoặc bộ xử lý thanh toán của chúng tôi có thể cố gắng thanh toán lại bất kỳ lúc nào. Nếu chúng tôi không thể thanh toán thành công, chúng tôi có thể chấm dứt hoặc tạm ngừng việc bạn sử dụng Dịch vụ cao cấp, tuy nhiên bạn vẫn nợ chúng tôi Phí đăng ký cho đến thời điểm chấm dứt hoặc tạm ngừng và (trong trường hợp tạm ngừng) cho khoảng thời gian tài khoản của bạn bị tạm ngừng, trong phạm vi được pháp luật hiện hành cho phép. Chúng tôi hoặc bộ xử lý thanh toán của chúng tôi có thể liên hệ với bạn nếu ngân hàng, tổ chức phát hành thẻ hoặc nhà cung cấp tài khoản khác của bạn từ chối thanh toán Phí đăng ký hoặc từ chối ủy quyền thanh toán định kỳ cho Phí đăng ký.",
    "content7": "Thay đổi phí. Chúng tôi có thể tăng hoặc giảm Phí đăng ký bất kỳ lúc nào theo quyết định riêng của chúng tôi (bao gồm cả việc giới thiệu các khoản phí cho các khía cạnh của Dịch vụ cao cấp trước đây được cung cấp miễn phí) và trong trường hợp đó, chúng tôi sẽ thông báo cho bạn một cách hợp lý trước khi thay đổi giá có hiệu lực, chẳng hạn như gửi email cho bạn hoặc thông qua một tin nhắn hiển thị trên Dịch vụ Tastopia. Nếu bạn không đồng ý với Phí đăng ký đã thay đổi, bạn có thể hủy đăng ký Dịch vụ cao cấp của mình trong vòng ba mươi (30) ngày sau khi chúng tôi thông báo cho bạn về sự thay đổi. Nếu bạn không hủy đăng ký của mình, thì bạn sẽ được coi là đã chấp nhận sự thay đổi và chúng tôi sẽ bắt đầu tính Phí đăng ký đã sửa đổi."
  },
  "section10": {
    "title": "HỦY DỊCH VỤ CAO CẤP",
    "content1": "Hủy Dịch vụ cao cấp đăng ký qua Trang web của chúng tôi. Đăng ký Dịch vụ cao cấp của chúng tôi được thanh toán trả trước cho một thời gian cố định. Sau khi bạn đã mua Đăng ký Dịch vụ cao cấp cho một thời gian cố định, Đăng ký của bạn sẽ kéo dài trong khoảng thời gian đã chọn và bạn sẽ không thể hủy nó trừ khi chúng tôi vi phạm các Điều khoản dịch vụ này hoặc bạn được phép khác. Vào cuối thời gian Đăng ký áp dụng, Đăng ký của bạn sẽ chấm dứt trừ khi bạn mua thêm Đăng ký.",
    "content2": "Hủy Dịch vụ cao cấp đăng ký qua Ứng dụng của chúng tôi. Để hủy đăng ký hàng tháng Dịch vụ cao cấp của chúng tôi, vui lòng tham khảo các trang sau: Android / iOS. Việc hủy sẽ có hiệu lực vào cuối kỳ thanh toán hàng tháng hiện tại. PHÍ ĐĂNG KÝ KHÔNG ĐƯỢC HOÀN LẠI VÀ KHÔNG CÓ KHOẢN HOÀN TRẢ HOẶC TÍN DỤNG CHO CÁC KỲ THANH TOÁN HÀNG THÁNG MỘT PHẦN."
  },
  "section11": {
    "title": "CHỦ SỞ HỮU NỘI DUNG VÀ QUYỀN BẠN CẤP PHÉP",
    "content1": "Chúng tôi không yêu cầu quyền sở hữu đối với bất kỳ công thức nấu ăn, ảnh, đồ họa, bình luận, thông tin, dữ liệu, văn bản hoặc tài liệu khác mà bạn tải lên hoặc đăng trên Trang web hoặc Ứng dụng của chúng tôi (“Nội dung”).",
    "content2": "Tuy nhiên, khi bạn tải lên Nội dung, bao gồm cả công thức nấu ăn, lên Trang web hoặc Ứng dụng của chúng tôi, bạn cấp cho chúng tôi quyền và giấy phép trên toàn thế giới, miễn phí bản quyền, liên tục và có thể chuyển nhượng (mà chúng tôi cũng có thể cấp cho các chi nhánh và bên thứ ba (các bên), bao gồm cả người dùng khác) để sử dụng, sao chép, tái tạo, xử lý, điều chỉnh, sửa đổi, dịch, xuất bản, truyền tải, hiển thị và phân phối (bao gồm cả qua bên thứ ba) Nội dung đó hoặc các phái sinh của nó, trong bất kỳ và tất cả các phương tiện hoặc phương pháp phân phối nào (hiện đã biết hoặc sau này được phát triển) cho bất kỳ và tất cả các hoạt động kinh doanh của chúng tôi. Bạn cũng đồng ý rằng:",
    "list1": "• giấy phép này bao gồm quyền của chúng tôi để cung cấp, quảng bá và khai thác thương mại Nội dung đã tải lên Trang web hoặc Ứng dụng của chúng tôi bằng bất kỳ phương tiện, cách thức hoặc hình thức nào cho hoặc với những người dùng hoặc người khác hợp tác với chúng tôi để phân phối hoặc xuất bản Nội dung trên các phương tiện và dịch vụ khác;\n\n• việc sử dụng bổ sung đó bởi chúng tôi, những người dùng khác của Trang web hoặc Ứng dụng của chúng tôi và những người khác hợp tác với chúng tôi để phân phối hoặc xuất bản Nội dung của bạn có thể được thực hiện mà không có bất kỳ khoản bồi thường nào được trả cho bạn liên quan đến Nội dung mà bạn tải lên Trang web hoặc Ứng dụng của chúng tôi;\n\n• bạn ủy quyền cho chúng tôi báo cáo vi phạm bản quyền thay mặt bạn cho đại lý được chỉ định, chủ sở hữu trang web, nhà cung cấp dịch vụ lưu trữ hoặc bất kỳ liên hệ thích hợp nào khác khi chúng tôi phát hiện Nội dung của bạn bị vi phạm; và\n\n• bạn từ bỏ hoặc, nơi không thể, đồng ý không xác nhận, tất cả các quyền nhân thân (và tất cả các quyền tương tự ở các quốc gia khác) mà bạn có hoặc sẽ có hiện tại hoặc trong tương lai đối với Nội dung của bạn."
  },
  "section12": {
    "title": "QUYỀN SỞ HỮU TRÍ TUỆ",
    "content1": "Ngoại trừ Nội dung của bạn, bao gồm cả công thức nấu ăn của bạn, tất cả các quyền sở hữu trí tuệ trong Dịch vụ Tastopia và tất cả các tài liệu trên Trang web hoặc Ứng dụng của chúng tôi, bao gồm thiết kế, đồ họa, văn bản, hình ảnh, phần mềm, các tệp khác và việc lựa chọn và sắp xếp chúng (gọi chung là “Tài liệu”) thuộc sở hữu của chúng tôi và/hoặc người cấp phép của chúng tôi.",
    "content2": "Chúng tôi cấp cho bạn quyền sử dụng Tài liệu trong phạm vi, và chỉ trong phạm vi, cần thiết để truy cập và sử dụng Dịch vụ Tastopia cho mục đích sử dụng cá nhân, phi thương mại của bạn theo các Điều khoản dịch vụ này. Tất cả các quyền khác đều được bảo lưu rõ ràng.",
    "content3": "Do đó:",
    "list1": "• bạn không được sử dụng bất kỳ phần nào của Tài liệu, hoặc Trang web hoặc Ứng dụng của chúng tôi, cho mục đích thương mại mà không có sự đồng ý rõ ràng từ chúng tôi và/hoặc (nếu áp dụng) người cấp phép của chúng tôi;\n\n• bạn không được sử dụng bất kỳ hình minh họa, ảnh, chuỗi video hoặc âm thanh hoặc bất kỳ đồ họa nào riêng biệt với bất kỳ văn bản đi kèm nào; hoặc\n\n• bạn không được sử dụng Tài liệu bên ngoài Trang web hoặc Ứng dụng của chúng tôi, đặc biệt là bằng cách xóa bất kỳ tình trạng nào của những người đóng góp đã được xác định là tác giả của Tài liệu trên Trang web hoặc Ứng dụng của chúng tôi."
  },
  "section13": {
    "title": "QUY TẮC ỨNG XỬ",
    "content1": "Bạn cam kết rằng bạn sẽ không:",
    "list1": "• vi phạm quyền sở hữu trí tuệ của bên thứ ba, bao gồm nhưng không giới hạn, quyền sở hữu trí tuệ như bản quyền và nhãn hiệu, của chúng tôi, người dùng khác hoặc bên thứ ba;\n\n• vi phạm quyền sở hữu, quyền riêng tư và quyền hình ảnh của chúng tôi, người dùng khác hoặc bên thứ ba;\n\n• tiết lộ thông tin, chẳng hạn như tên, địa chỉ bưu điện, số điện thoại và địa chỉ email của một cá nhân cụ thể mà không được phép, và qua đó bất kỳ bên thứ ba nào có thể nhận dạng được cá nhân đó;\n\n• đăng ký nhiều địa chỉ email để có nhiều tài khoản, trong khi chỉ là một người dùng duy nhất;\n\n• nhận tài khoản thay mặt cho Người dùng đã đăng ký có tài khoản đã bị tạm ngừng hoặc chấm dứt;\n\n• phân biệt đối xử, quấy rối, bắt nạt, đe dọa, phỉ báng, hoặc làm tổn hại danh tiếng và uy tín của người dùng khác hoặc bên thứ ba;\n\n• thay đổi và/hoặc xóa Tài liệu được cung cấp thông qua Dịch vụ Tastopia;\n\n• mạo danh chúng tôi, người dùng khác hoặc bên thứ ba (bao gồm cả việc làm giả tiêu đề email nhằm mục đích giả mạo nguồn tiêu đề email và danh tính người gửi);\n\n• truyền tải các chương trình máy tính hoặc virus gây hại hoặc khiến người dùng khác hoặc bên thứ ba nhận được các chương trình hoặc virus đó;\n\n• truy cập trái phép, hoặc thực hiện quét cổng, tấn công từ chối dịch vụ, hoặc gửi thư rác vào các cơ sở của người dùng khác hoặc bên thứ ba hoặc các cơ sở được sử dụng bởi Dịch vụ Tastopia (bao gồm, nhưng không giới hạn, các cơ sở viễn thông, máy tính và thiết bị khác, cũng như phần mềm được chúng tôi sử dụng trong việc cung cấp Dịch vụ Tastopia) và/hoặc gây ra hoặc cố gắng gây cản trở việc sử dụng hoặc vận hành các cơ sở đó;\n\n• truyền tải, không được phép, email quảng cáo hoặc khuyến mãi hoặc kêu gọi hoặc có tính chất gây phản cảm (bao gồm thư rác); cản trở việc nhận email của người dùng khác hoặc bên thứ ba; yêu cầu truyền tải email chuỗi và/hoặc truyền tải email chuỗi theo các yêu cầu đó;\n\n• lưu hành thông tin, thiết bị và phần mềm được sử dụng nhằm mục đích vô hiệu hóa hoặc phá vỡ chức năng kiểm soát truy cập của máy chủ và các cơ sở khác;\n\n• tái tạo, sửa đổi, dịch ngược, phân tích kỹ thuật đảo ngược hoặc phân tích các mẫu hoặc phần mềm có trong Tài liệu (trừ khi được pháp luật cho phép, và bạn đồng ý thông báo cho chúng tôi trong trường hợp đó);\n\n• lấy thông tin tài khoản không được phép hoặc thông qua gian lận (bao gồm, nhưng không giới hạn, bằng hình thức lừa đảo trực tuyến hoặc các phương pháp tương tự);\n\n• sử dụng Dịch vụ Tastopia cho các hoạt động thương mại (bao gồm bất kỳ hoạt động nào được khuyến khích), vì lợi nhuận và với mục đích kiếm lợi nhuận, trừ khi có sự chấp thuận bằng văn bản trước từ chúng tôi;\n\n• sử dụng Dịch vụ Tastopia cho chiến dịch bầu cử hoặc các hoạt động chính trị khác;\n\n• sử dụng Dịch vụ Tastopia vi phạm pháp luật và các quy định hiện hành;\n\n• cản trở hoạt động của Dịch vụ Tastopia hoặc cản trở việc trao đổi hoặc chia sẻ Nội dung được đóng góp bởi người dùng khác hoặc bên thứ ba; hoặc gây ra thiệt hại hoặc tổn thất cho chúng tôi, người dùng khác hoặc bên thứ ba bằng cách làm tổn hại uy tín của họ hoặc vi phạm quyền sở hữu trí tuệ của họ;\n\n• gây cản trở đáng kể đến hoạt động kinh doanh của chúng tôi thông qua các yêu cầu hoặc email lặp đi lặp lại, phù phiếm hoặc gây khó chịu, vượt ra ngoài nghĩa vụ của chúng tôi và/hoặc không hợp lý;\n\n• vi phạm các Điều khoản dịch vụ; hoặc cản trở trật tự công cộng và đạo đức (bao gồm, nhưng không giới hạn, bằng cách truyền tải hoặc hiển thị Nội dung có thể khuyến khích và gây ra bạo lực, hình ảnh bất hợp pháp hoặc tự tử);\n\n• thiết lập liên kết đến Trang web hoặc Ứng dụng của chúng tôi nhằm khuyến khích bất kỳ hành động nào, bao gồm cả hành động của bên thứ ba, được mô tả ở trên;\n\n• vi phạm các yêu cầu khác mà chúng tôi có thể áp đặt theo thời gian theo quyết định riêng và tuyệt đối của chúng tôi; hoặc\n\n• sử dụng Dịch vụ Tastopia theo cách mà Tastopia cho là không phù hợp hoặc không thích hợp một cách hợp lý. Tastopia sẽ dựa vào các yếu tố như việc sử dụng Dịch vụ Tastopia điển hình của phần lớn người dùng và thông lệ chung của ngành, khi xác định xem việc sử dụng đó có không phù hợp hoặc không thích hợp hay không."
  },
  "section14": {
    "title": "QUÉT HÌNH ẢNH TỰ ĐỘNG",
    "content1": "Là một tính năng tùy chọn, Tastopia có thể cung cấp phân loại hình ảnh tự động hỗ trợ bạn tải lên các hình ảnh liên quan đến thực phẩm. Nếu bạn chọn sử dụng tính năng tùy chọn này, các hình ảnh có sẵn trên thiết bị của bạn sẽ được gửi đến máy chủ của chúng tôi và được quét tự động bằng phần mềm nhận dạng hình ảnh tự động cố gắng xác định những hình ảnh nào của bạn liên quan đến thực phẩm. Các hình ảnh tạm thời được xác định là liên quan đến thực phẩm sẽ được hiển thị cho bạn trên trang cá nhân của bạn trong Ứng dụng của chúng tôi, chỉ bạn mới có quyền truy cập. Bạn có thể xóa thủ công các hình ảnh không mong muốn hiển thị trên trang cá nhân. Bất kỳ hình ảnh nào không được xác định là liên quan đến thực phẩm, hoặc mà bạn đã xóa thủ công, sẽ bị xóa khỏi máy chủ của Tastopia."
  },
  "section15": {
    "title": "TRÁCH NHIỆM ĐỐI VỚI NỘI DUNG",
    "content1": "Bạn hoàn toàn chịu trách nhiệm đối với Nội dung mà bạn đăng, tải lên và/hoặc xuất bản bằng cách sử dụng Dịch vụ Tastopia. Chúng tôi không xem xét hoặc sàng lọc bất kỳ Nội dung nào của bạn trước khi Nội dung đó xuất hiện hoặc được chia sẻ.",
    "content2": "Bạn cam kết rằng:",
    "list1": "• bất kỳ Nội dung nào bạn đăng hoặc xuất bản đều tuân thủ các Điều khoản dịch vụ này;\n\n• bạn có quyền sử dụng, tải lên, đăng hoặc xuất bản Nội dung lên Ứng dụng hoặc Trang web của chúng tôi và cấp giấy phép cho chúng tôi như được nêu trong Mục 10; và\n\n• việc Tastopia sử dụng Nội dung bạn đã tải lên, đăng hoặc xuất bản sẽ không vi phạm quyền của bất kỳ bên thứ ba nào.",
    "content3": "Bạn đồng ý và thừa nhận rằng:",
    "list2": "• chúng tôi sẽ không chịu trách nhiệm hoặc chịu nghĩa vụ đối với bất kỳ bên thứ ba nào về Nội dung hoặc tính chính xác của bất kỳ Nội dung nào được đăng bởi bạn hoặc bất kỳ người dùng nào khác của Trang web hoặc Ứng dụng của chúng tôi;\n\n• chúng tôi có quyền xóa bất kỳ Nội dung nào bạn cung cấp trên Trang web hoặc Ứng dụng của chúng tôi theo quyết định riêng của chúng tôi, bao gồm; nếu, theo ý kiến của chúng tôi, Nội dung của bạn không tuân thủ các Điều khoản dịch vụ này, hoặc nếu chúng tôi tin rằng điều đó là cần thiết để bảo vệ chúng tôi, người dùng khác hoặc bất kỳ bên thứ ba nào; và\n\n• bạn hoàn toàn chịu trách nhiệm bảo mật và sao lưu Nội dung của bạn."
  },
  "section16": {
    "title": "THAY ĐỔI ĐIỀU KHOẢN NÀY",
    "content1": "Chúng tôi có thể sửa đổi các Điều khoản dịch vụ này (“Thay đổi”) bất kỳ lúc nào nếu:",
    "list1": "• có thay đổi trong luật và quy định hiện hành;\n\n• có thay đổi trong thông số kỹ thuật hoặc hoạt động của Dịch vụ Tastopia;\n\n• có thay đổi trong chính sách nhóm hoặc quy định nội bộ của Tastopia;\n\n• có thay đổi trong thông số kỹ thuật hoặc chính sách dịch vụ của các dịch vụ bên thứ ba bên ngoài được Tastopia sử dụng hoặc kết nối với Dịch vụ Tastopia;\n\n• có thay đổi trong môi trường kinh doanh mà Tastopia hoạt động;\n\n• cần thiết để ứng phó với các mối đe dọa thực tế hoặc tiềm ẩn đối với hoạt động kinh doanh của chúng tôi (chẳng hạn như các mối đe dọa an ninh mạng), hoặc các hành vi hoặc hành vi không mong muốn hoặc nguy hiểm trong cộng đồng của chúng tôi;\n\n• cần thiết để làm rõ hoặc sửa chữa bất kỳ phần nào của các Điều khoản dịch vụ này; hoặc\n\n• các tình huống khác, không lường trước được, có thể hợp lý yêu cầu chúng tôi sửa đổi các Điều khoản dịch vụ này;",
    "content2": "Vui lòng kiểm tra trang này theo thời gian để nhận biết bất kỳ Thay đổi nào mà chúng tôi thực hiện, vì chúng ràng buộc bạn, trừ khi bạn chấm dứt tài khoản của mình. Chúng tôi sẽ thông báo cho bạn về các Thay đổi quan trọng, bao gồm cả việc đăng khi bạn truy cập Trang web hoặc Ứng dụng của chúng tôi hoặc qua email đến địa chỉ email đã đăng ký khi bạn đăng ký tài khoản.",
    "content3": "Nếu bạn tiếp tục sử dụng Dịch vụ Tastopia sau khi có Thay đổi, bạn đồng ý với các Thay đổi. Nếu bạn không chấp nhận Thay đổi: (i) nếu bạn là Khách hoặc Người dùng đã đăng ký, vui lòng ngừng sử dụng Dịch vụ Tastopia hoặc (ii) nếu bạn là người dùng Dịch vụ cao cấp, bạn phải chấm dứt đăng ký của mình trong vòng ba mươi (30) ngày sau khi chúng tôi thông báo cho bạn về Thay đổi (hoặc bạn nhận biết được sớm hơn).",
    "content4": "Nếu bạn ngừng sử dụng Dịch vụ Tastopia hoặc chấm dứt Dịch vụ cao cấp (tùy trường hợp áp dụng) theo đoạn trước, các Thay đổi liên quan sẽ không ràng buộc bạn. Xin lưu ý rằng, ngay cả khi các Thay đổi không ràng buộc bạn, nếu bạn không chấm dứt đăng ký của mình trước ngày gia hạn tiếp theo, bạn sẽ bị tính phí đăng ký cho dịch vụ của tháng tiếp theo.",
    "content5": "Các Điều khoản dịch vụ này được cập nhật lần cuối vào ngày 01 tháng 01 năm 2025. Chúng tôi đã cập nhật các Điều khoản dịch vụ để:",
    "list2": "• sửa đổi thực thể ký hợp đồng từ Tastopia Limited thành chi nhánh đăng ký tại Việt Nam của Tastopia, Inc.; và\n\n• thực hiện một số cập nhật chung về luật tiêu dùng và ngôn ngữ rõ ràng hơn (bao gồm sửa đổi Mục 19 và 23, và một Mục mới 24)."
  },
  "section17": {
    "title": "THAY ĐỔI TRANG WEB HOẶC ỨNG DỤNG VÀ DỊCH VỤ tastopia CỦA CHÚNG TÔI",
    "content1": "Chúng tôi có thể cập nhật Trang web hoặc Ứng dụng của mình theo thời gian và có thể thay đổi Tài liệu bất cứ lúc nào. Chúng tôi cũng có quyền thay đổi và cải thiện các tính năng và chức năng của Dịch vụ Tastopia bất cứ lúc nào và theo quyết định riêng của chúng tôi. Điều này bao gồm việc thêm, sửa đổi hoặc xóa các tính năng và chức năng cụ thể của Dịch vụ Tastopia. Nếu chúng tôi có ý định xóa bất kỳ chức năng quan trọng nào của Dịch vụ cao cấp mà bạn đăng ký, chúng tôi sẽ thông báo trước cho bạn một cách hợp lý. Xin lưu ý rằng bất kỳ Tài liệu nào trên Trang web hoặc Ứng dụng của chúng tôi có thể bị lỗi thời vào bất kỳ thời điểm nào và chúng tôi không có nghĩa vụ phải cập nhật chúng."
  },
  "section18": {
    "title": "TẠM NGỪNG HOẶC NGỪNG CUNG CẤP DỊCH VỤ tastopia VĨNH VIỄN",
    "content1": "Chúng tôi không cam kết rằng Dịch vụ Tastopia, hoặc bất kỳ Tài liệu nào trên Trang web và Ứng dụng sẽ luôn khả dụng hoặc không bị gián đoạn. Chúng tôi có thể tạm ngừng, thu hồi hoặc ngừng cung cấp toàn bộ hoặc bất kỳ phần nào của Dịch vụ Tastopia mà không cần thông báo trước. Chúng tôi sẽ không chịu trách nhiệm với bạn nếu vì bất kỳ lý do gì mà Dịch vụ Tastopia của chúng tôi không khả dụng vào bất kỳ lúc nào hoặc trong bất kỳ khoảng thời gian nào.",
    "content2": "Chúng tôi cũng có thể tạm ngừng hoặc hủy quyền truy cập hoặc quyền sử dụng Dịch vụ Tastopia của bạn khi chúng tôi rút lại chúng, trong trường hợp đó chúng tôi sẽ thông báo trước cho bạn một cách hợp lý."
  },
  "section19": {
    "title": "HẠN CHẾ, TẠM NGỪNG HOẶC HỦY BỎ VIỆC SỬ DỤNG",
    "content1": "Chúng tôi có thể hạn chế, tạm ngừng, thu hồi hoặc ngừng cung cấp quyền truy cập hoặc quyền sử dụng Dịch vụ Tastopia của bạn mà không cần thông báo trước trong các trường hợp sau. Khi có thể, chúng tôi sẽ thông báo cho bạn về ý định thực hiện việc này, tuy nhiên:",
    "list1": "• bạn đã vi phạm các Điều khoản dịch vụ này;\n\n• bạn đã cung cấp cho chúng tôi thông tin sai;\n\n• bạn đang sử dụng Dịch vụ Tastopia một cách bất hợp pháp hoặc vi phạm quyền của bất kỳ bên thứ ba nào;\n\n• bạn chưa thanh toán Phí đăng ký Dịch vụ cao cấp, chúng tôi đã nhắc nhở bạn về điều này và bạn vẫn chưa thanh toán;\n\n• cần thiết để bảo vệ chúng tôi, người dùng khác hoặc bất kỳ bên thứ ba nào;\n\n• có khả năng các yêu cầu hoặc tố tụng có thể được đưa ra chống lại chúng tôi bởi bên thứ ba do các trường hợp liên quan đến việc bạn sử dụng Dịch vụ Tastopia;\n\n• không thể liên lạc với bạn qua điện thoại, fax và/hoặc email;\n\n• là trường hợp khẩn cấp; và/hoặc\n\n• cần thiết cho việc vận hành Dịch vụ Tastopia.",
    "content2": "Việc hạn chế, tạm ngừng, thu hồi hoặc ngừng cung cấp Dịch vụ Tastopia có thể dẫn đến mất quyền truy cập vĩnh viễn và sử dụng một số khía cạnh của dịch vụ, bao gồm cả Nội dung bạn đã tải lên, ngay cả khi bạn sau này đăng ký lại hoặc đăng ký lại Dịch vụ Tastopia."
  },
  "section20": {
    "title": "HẠN CHẾ TRÁCH NHIỆM CỦA CHÚNG TÔI",
    "content1": "Không có điều khoản nào trong các Điều khoản dịch vụ này loại trừ hoặc giới hạn trách nhiệm của chúng tôi đối với tử vong hoặc thương tích cá nhân phát sinh từ sự sơ suất của chúng tôi, hoặc sự gian lận hoặc trình bày sai sự thật gian lận của chúng tôi.",
    "content2": "Chúng tôi sẽ không chịu trách nhiệm với bạn về bất kỳ tổn thất hoặc thiệt hại nào bạn phải chịu mà: (i) không thể lường trước một cách hợp lý tại thời điểm bạn chấp nhận các Điều khoản dịch vụ này - tổn thất hoặc thiệt hại có thể lường trước một cách hợp lý nếu rõ ràng tại thời điểm bạn chấp nhận các Điều khoản dịch vụ này rằng nó có thể xảy ra, hoặc cả bạn và chúng tôi đều biết nó có thể xảy ra, ví dụ: nếu bạn và chúng tôi đã thảo luận về nó; hoặc (ii) không do chúng tôi vi phạm một điều khoản của các Điều khoản dịch vụ này, hoặc bất kỳ thất bại nào khác của chúng tôi.",
    "content3": "Chúng tôi cũng sẽ không chịu trách nhiệm với bạn về:",
    "list1": "• bất kỳ lỗi hoặc thiếu sót nào trong bất kỳ công thức nấu ăn hoặc Tài liệu khác;\n\n• việc sử dụng hoặc dựa vào bất kỳ Tài liệu nào hiển thị trên Trang web hoặc Ứng dụng của chúng tôi;\n\n• bất kỳ quyền truy cập trái phép nào vào hoặc sử dụng các máy chủ bảo mật của chúng tôi hoặc bất kỳ và tất cả thông tin cá nhân không được bảo mật nào;\n\n• bất kỳ gián đoạn hoặc ngừng truyền tải đến hoặc từ Trang web hoặc Ứng dụng của chúng tôi;\n\n• virus, tấn công từ chối dịch vụ phân tán, hoặc tài liệu khác gây hại về mặt công nghệ có thể lây nhiễm vào thiết bị máy tính, chương trình máy tính, dữ liệu hoặc tài sản độc quyền khác của bạn do việc bạn sử dụng Trang web hoặc Ứng dụng của chúng tôi hoặc do bạn tải xuống bất kỳ Tài liệu nào trên đó, hoặc trên bất kỳ trang web nào được liên kết với nó;\n\n• nội dung của các trang web được liên kết trên Trang web hoặc Ứng dụng của chúng tôi; hoặc\n\n• các yêu cầu, xác nhận, khiếu nại, kiện tụng, hành động hoặc các thủ tục tố tụng khác của bên thứ ba đưa ra chống lại bạn từ người dùng khác, cáo buộc rằng Nội dung của bạn vi phạm quyền sở hữu trí tuệ của bất kỳ bên thứ ba nào, hoặc chiếm dụng thông tin mật của bên thứ ba;",
    "content4": "Trách nhiệm giới hạn đối với người dùng đã đăng ký Dịch vụ cao cấp Chúng tôi sẽ chỉ chịu trách nhiệm đối với Người dùng đã đăng ký Dịch vụ cao cấp tối đa giới hạn tổng số Phí đăng ký mà Người dùng đã đăng ký đó đã trả cho chúng tôi đối với Dịch vụ cao cấp."
  },
  "section21": {
    "title": "KẾT NỐI INTERNET",
    "content1": "Để sử dụng Trang web và Ứng dụng của chúng tôi, thiết bị của bạn sẽ cần kết nối internet. Bạn hoàn toàn chịu trách nhiệm, tự chi trả chi phí, để có bất kỳ phần cứng, phần mềm và dịch vụ bên thứ ba nào (chẳng hạn như gói dịch vụ không dây được mua thông qua nhà cung cấp dịch vụ viễn thông) cần thiết để kết nối thiết bị của bạn với internet, bao gồm bất kỳ khoản phí truyền dữ liệu nào có thể bị áp đặt bởi nhà cung cấp dịch vụ bạn đã chọn và, nếu bạn chọn tải lên lượng lớn dữ liệu như tệp hình ảnh, có thể rất đáng kể."
  },
  "section22": {
    "title": "LIÊN KẾT BÊN THỨ BA VÀ NGUỒN LỰC TRONG TRANG WEB HOẶC ỨNG DỤNG CỦA CHÚNG TÔI",
    "content1": "Trong trường hợp Trang web hoặc Ứng dụng của chúng tôi chứa các liên kết đến các trang web và nguồn lực khác do bên thứ ba cung cấp, các liên kết này chỉ được cung cấp cho thông tin của bạn. Chúng tôi không kiểm soát nội dung của các trang web hoặc nguồn lực đó."
  },
  "section23": {
    "title": "QUYỀN CỦA BÊN THỨ BA",
    "content1": "Các bên có ý định rằng không ai không phải là bên của các điều khoản này sẽ có bất kỳ quyền nào theo Đạo luật Hợp đồng (Quyền của bên thứ ba) năm 1999 hoặc theo cách khác để thực thi bất kỳ điều khoản nào của các Điều khoản dịch vụ này. Không cần sự đồng ý của bất kỳ bên thứ ba nào để sửa đổi các điều khoản này."
  },
  "section24": {
    "title": "LUẬT ÁP DỤNG VÀ THẨM QUYỀN",
    "content1": "Chúng tôi sẽ cố gắng hết sức để giải quyết bất kỳ tranh chấp nào về các Điều khoản dịch vụ này.",
    "content2": "Các Điều khoản dịch vụ này, đối tượng của chúng và việc hình thành chúng, được điều chỉnh bởi luật pháp Anh. Tuy nhiên, nếu bạn là người tiêu dùng và cư trú tại bất kỳ quốc gia nào khác thuộc Liên minh châu Âu, bạn sẽ được hưởng lợi từ, và nếu bạn là người tiêu dùng và cư trú tại bất kỳ quốc gia nào khác không thuộc Liên minh châu Âu, bạn có thể được hưởng lợi từ các quy định bắt buộc và các quyền pháp lý có sẵn cho bạn theo luật pháp của quốc gia đó. Không có điều khoản nào trong các Điều khoản dịch vụ này ảnh hưởng đến quyền của bạn với tư cách là người tiêu dùng khi dựa vào các quy định bắt buộc của luật địa phương và các quyền pháp lý này.",
    "content3": "Bạn và chúng tôi đều đồng ý rằng tòa án Anh và xứ Wales sẽ có thẩm quyền không độc quyền. Tuy nhiên, nếu bạn là người tiêu dùng và cư trú tại bất kỳ quốc gia nào khác, bạn và chúng tôi cũng có thể đưa vụ kiện tại quốc gia đó."
  },
  "section25": {
    "title": "NHÃN HIỆU THƯƠNG MẠI",
    "content1": "“tastopia” và logo tastopia là nhãn hiệu đã đăng ký của Tastopia Inc. tại Việt Nam, Vương quốc Anh và một số khu vực pháp lý khác."
  },
  "section26": {
    "title": "LIÊN HỆ CHÚNG TÔI",
    "content1": "Để liên hệ với chúng tôi, vui lòng gửi email đến tastopiaapp@gmail.com",
    "content2": "Nếu bạn cư trú tại một quốc gia thuộc Liên minh Châu Âu:\n\nNếu bạn đã bắt đầu sử dụng Dịch vụ cao cấp, bạn có quyền thay đổi ý định và nhận hoàn lại đầy đủ trong vòng mười bốn (14) ngày kể từ lần đầu tiên đăng ký, bằng cách gửi email cho chúng tôi tại tastopiaapp@gmail.com với nội dung sau:",
    "content3": "Tôi xin thông báo rằng tôi hủy hợp đồng đăng ký Dịch vụ cao cấp đã đặt vào ngày\n\nTên người tiêu dùng:\n\nTên người dùng:\n\nĐịa chỉ người tiêu dùng:\n\nNgày:",
    "content4": "Nếu bạn cư trú tại Tây Ban Nha:\n\nBạn cũng có thể liên hệ với chúng tôi theo số điện thoại: +84 362829583\n\nGiấy phép đối với Nội dung đã tải lên mà bạn cấp cho chúng tôi theo Mục 10 sẽ có hiệu lực trong khoảng thời gian tồn tại của các quyền theo bất kỳ luật áp dụng nào.\n\nĐoạn (iv) trong Mục 10 sẽ không áp dụng và sẽ được coi là đã xóa.\n\nCác Điều khoản dịch vụ này có thể được in và tải xuống bởi bạn dưới dạng bản cứng bất cứ lúc nào.",
    "content5": "Nếu bạn cư trú tại Hoa Kỳ:\n\nTastopia tuân thủ Đạo luật bản quyền kỹ thuật số thiên niên kỷ (17 U.S.C. §512). Nếu bạn tin rằng bất kỳ tài liệu nào trên Trang web của chúng tôi vi phạm bản quyền của bạn, vui lòng thông báo cho đại lý được chỉ định của chúng tôi tại địa chỉ sau: tastopiaapp@gmail.com.",
    "content6": "Thông báo của bạn cho đại lý của chúng tôi phải bao gồm mô tả về tác phẩm của bạn mà bạn tin rằng đã bị vi phạm; vị trí trên Trang web của chúng tôi nơi chúng tôi có thể tìm thấy tài liệu vi phạm; thông tin liên hệ của bạn bao gồm tên, địa chỉ, số điện thoại và địa chỉ email; và một tuyên bố của bạn, được ký dưới hình phạt khai man, rằng bạn là chủ sở hữu bản quyền và bạn tin rằng việc sử dụng tài liệu được báo cáo là không được phép.",
    "content7": "Nếu bạn cư trú tại Ấn Độ:\n\nBạn cũng có thể liên hệ với chúng tôi qua email tại tastopiaapp@gmail.com.",
    "content8": "Điều khoản và Điều kiện này là bản ghi điện tử theo Đạo luật Công nghệ thông tin, 2000 (đã sửa đổi/ban hành lại) và các quy tắc theo đó, và được công bố theo các quy định của Quy tắc 3 (1) của Quy tắc Công nghệ thông tin (Hướng dẫn trung gian và mã Đạo đức truyền thông kỹ thuật số), 2021, quy định việc công bố các quy tắc và quy định, chính sách bảo mật và điều khoản sử dụng để truy cập hoặc sử dụng Ứng dụng. Bản ghi điện tử này được tạo ra bởi hệ thống máy tính và không yêu cầu bất kỳ chữ ký vật lý hoặc kỹ thuật số nào."
  },
  "section27": {
    "title": "Về các Điều khoản dịch vụ này",
    "content1": "Nếu bất kỳ điều khoản, hoặc một phần của điều khoản, của các Điều khoản dịch vụ này bị từ chối hoặc bị tòa án hoặc cơ quan quản lý nào đó xác định là không thể thi hành, các điều khoản khác sẽ tiếp tục áp dụng.",
    "content2": "Nếu bạn hoặc chúng tôi vi phạm các Điều khoản dịch vụ này và bạn hoặc chúng tôi không có hành động nào chống lại bên kia, bạn hoặc chúng tôi vẫn có quyền sử dụng các quyền và biện pháp khắc phục của mình trong bất kỳ tình huống nào khác mà bạn hoặc chúng tôi vi phạm các Điều khoản dịch vụ này.",
    "content3": "Cảm ơn bạn đã sử dụng Dịch vụ Tastopia."
  }
}
